{
    "_info":{
        "name":"English",
        "code":"en-us"
    },
    "common":{
        "name": "Isaac Ramírez",
        "tabtitle": "Isa Wild Developer"
    },
    "navbar":{
        "this_is_me":"This is me"
    },
    "home":{
        "welcome":{
            "title":"Isaac Sarceño",
            "subtitle": "Developer / ",
            "subttitle_lines": [
                "Just living",
                "Just Growing",
                "Just Learning to living",
                "Embracing technology"
            ],
            "descriptions":[
                "I am a person highly committed to each project in which I participate and passionate about creating high-impact technological solutions. I firmly believe that technology is a tool that is learned, but what is truly important is to thoroughly understand the problem and draw the most effective and efficient path towards its solution.",
                "I have more than five years of experience developing creative fullstack solutions for complex challenges, using a broad technological stack and easily adapting to different environments. I have worked with clients from various sectors such as banking, health, telecommunications and government, each with unique objectives, restrictions and technological ecosystems. This diversity has given me a comprehensive vision and allows me to adapt quickly to new challenges.",
                "My approach is results-oriented, with a combination of strategic thinking, technical skills and a strong analytical capacity, which makes me a valuable ally for any team or project."
            ]
        },
        "timeline": {
            "title": "Timeline",
            "descriptions": ""
        }
    },
    "skills": {
        "title": "Mis habilidades"
    },
    "profile":{
        "title":"Sobre mí",
        "tagline":"Abraza la tecnología"
    },
    "contact":{
        "title":"Contáctame",
        "name_field": "Nombre",
        "email_field": "Correo electrónico",
        "message_field": "Mensaje",
        "message_placeholder": "Escribe tu mensaje aquí...",
        "send_button": "Enviar",
        "success_title": "Exito!",
        "success_message":"Se ha enviado tu mensaje correctamente, Isaac responderá a la brevedad posible.",
        "error_captcha":"Ups! ocurrio un error, intentalo nuevamente",
        "error_message":"Ocurio un error al enviar tu mensaje, intentalo nuevamente mas tarde"
    },
    "chat":{
        "bot_name": "ISA BOT",
        "i_am_bot_message":"Soy el asistente virtual de Isaac, ¿en qué puedo ayudarte hoy?",
        "its_a_pleasure":"Es un placer ayudarte!",
        "askme_placeholder":"Preguntame algo sobre Isaac",
        "error_chatting":"Ups! ocurrio un error",
        "hit_limit_1": "Parece que has alcanzado el limite de preguntas",
        "hit_limit_2": "Parece que has alcanzado el limite de chats",
        "captcha_message":"Por favor marca la casilla para continuar"
    }
}