{
    "_info":{
        "name": "English",
        "code": "en-us"
    },
    "common":{
        "name": "Isaac Ramírez",
        "tabtitle": "Isaac | AI & Fullstack Engineer"
    },
    "navbar":{
        "this_is_me": "My timeline",
        "home": "Home",
        "skills": "Skills",
        "top-projects": "Top Projects",
        "profile": "Profile",
        "hobbies": "Hobbies",
        "contact": "Contact"
    },
    "home":{
        "title":"My timeline",
        "welcome":{
            "title": "Isaac Sarceño",
            "subtitle": "Developer / ",
            "subttitle_lines": [
                "AI & Fullstack Developer",
                "Powered by artificial intelligence",
                "Creating business solutions",
                "Learning to live",
                "Embracing technology"
            ],
            "descriptions":[
                "Passionate about creating high-impact solutions with AI-powered agents and data integrations beyond APIs, I firmly believe that technology is the tool, but understanding the problem deeply is the key. My approach combines strategic thinking and technical skills to chart the most efficient path to the result.",
                "I take AI beyond APIs, specializing in the architecture and development of systems with multi-agent frameworks and MCP/A2A protocols. My focus is on building and deploying AI solutions that solve complex business challenges, transforming creativity and code into business optimization.",
                "With over five years of experience, I have developed fullstack solutions for complex challenges in sectors such as banking, healthcare, telecommunications, and government. This diversity allows me to adapt with agility to any technological ecosystem and deliver consistent results.",
                "My commitment, honesty, and responsibility are the pillars of my work, making me a valuable ally for any team or project."
            ]
        },
        "tabnames":{
            "roles":"Roles",
            "projects":"Projects",
            "resume":"Resume",
            "charts": "Charts"
        }
    },
    "skills": {
        "title": "My skills"
    },
    "profile":{
        "title":"About me",
        "tagline":"Embrace technology"
    },
    "contact":{
        "title":"Contact me",
        "name_field": "Name",
        "email_field": "Email",
        "message_field": "Message",
        "empty_captcha": "Please complete the ReCAPTCHA before submitting the form.",
        
        "confirmation_subject": "Message submission confirmation",
        "confirmation_greeting": "Hello",
        "confirmation_bot_intro": "I'm Isa bot",
        "confirmation_message_received": "Thank you for your message. Here is what you sent us:",
        "confirmation_delivered": "I have delivered your message correctly to Isaac. He will contact you as soon as possible.",
        "confirmation_thanks": "Thank you for your interest and for contacting him!",
        "confirmation_footer": "This is an automatic message sent by IsaBot. Do not reply directly to this email.",

        "message_placeholder": "Write your message here...",
        "send_button": "Send",
        "success_title": "Success!",
        "success_message":"Thank you for your message, check your inbox, we sent you an email with the confirmation of your message, if you do not receive it, check the address entered :D",
        "error_captcha":"Oops! an error occurred, please try again",
        "error_message":"An error occurred while sending your message, please try again later"
    },
    "chat":{
        "bot_name": "ISA BOT",
        "i_am_bot_message":"I am Isaac's virtual assistant, how can I help you today?",
        "its_a_pleasure":"It's a pleasure to help you!",
        "askme_placeholder":"Ask me something about Isaac",
        "error_chatting":"Oops! an error occurred",
        "error_response":"An error occurred while getting the response, please try again later",
        "hit_limit_1": "It seems you have reached the question limit",
        "hit_limit_2": "It seems you have reached the chat limit, you can try again tomorrow",
        "captcha_message":"Please check the box to continue",
        "mistakes":"ISA BOT can make mistakes"
    },
    "cookies": {
        "message": "We use cookies to improve your experience. By continuing to browse, you accept our use of cookies.",
        "accept": "Accept",
        "policy": "Privacy Policy"
    },
    "policy": {
        "title": "Privacy Policy",
        "last_updated": "Last updated: August 2025",
        "introduction_title": "Introduction",
        "introduction_text": "This Privacy Policy describes how we collect, use, and disclose your information.",
        "cookies_title": "Cookies",
        "cookies_text": "We use cookies to operate and improve our services. A cookie is a small piece of data stored on your device. We use a 'lang' cookie to store your language preference and a 'browser_id' cookie to uniquely identify your browser for analytics and security purposes.",
        "data_title": "Data Collection and Use",
        "data_text": "When you use our contact form or chat, we collect your name, email, and the content of your message, along with your 'browser_id' and 'lang' cookies. This data is used to respond to your inquiries and improve our services."
    }
}
