{
    "_info": {
        "name": "Español (Salvadoreño)",
        "code": "es-sv"
    },
    "common": {
        "name": "Isaac Ramírez",
        "tabtitle": "Isaac | AI & Fullstack Engineer"
    },
    "navbar": {
        "this_is_me": "Mi recorrido"
    },
    "nav": {
        "home": "Inicio",
        "skills": "Habilidades",
        "profile": "Perfil",
        "contact": "Contacto"
    },
    "home": {
        "title": "Mi recorrido",
        "welcome": {
            "title": "Isaac Sarceño",
            "subtitle": "Developer / ",
            "subttitle_lines": [
                "Desarrollador IA & Fullstack",
                "Potenciado por inteligencia artificial",
                "Creando soluciones chivas",
                "Aprendiendo a vivir",
                "Dándole a la tecnología"
            ],
            "descriptions": [
                "Apasionado por crear soluciones de alto impacto con agentes potenciados con inteligencia artificial e integraciones con datos mas allá de las APIs, creo firmemente que la tecnología es la herramienta, pero entender el problema a fondo es la clave. Mi enfoque combina pensamiento estratégico y habilidades técnicas para trazar el camino más eficiente hacia el resultado.",
                "Llevo la IA más allá de las APIs, especializándome en la arquitectura y desarrollo de sistemas con frameworks multi agenticos y protocolos MCP/A2A. Mi enfoque es construir y desplegar soluciones de IA que resuelven desafíos de negocio complejos, transformando la creatividad y el código en optimización empresarial.",
                "Con más de cinco años de experiencia, he desarrollado soluciones fullstack para desafíos complejos en sectores como banca, salud, telecomunicaciones y gobierno. Esta diversidad me permite adaptarme con agilidad a cualquier ecosistema tecnológico y entregar resultados consistentes.",
                "Mi compromiso, honestidad y responsabilidad son los pilares de mi trabajo, convirtiéndome en un aliado valioso para cualquier equipo o proyecto."
            ]
        },
        "tabnames": {
            "roles": "Roles",
            "projects": "Proyectos",
            "resume": "Resumen",
            "charts": "Gráficos"
        }
    },
    "skills": {
        "title": "Mis habilidades"
    },
    "profile": {
        "title": "Sobre mí",
        "tagline": "Abraza la tecnología"
    },
    "contact": {
        "title": "Escribime",
        "name_field": "Tu nombre",
        "email_field": "Tu correo",
        "message_field": "Tu mensaje",
        "empty_captcha": "Vaya, tenés que completar el ReCAPTCHA antes de mandar el mensaje.",
        "confirmation_subject": "Confirmación de tu mensaje",
        "confirmation_greeting": "Hey",
        "confirmation_bot_intro": "soy Isa bot, el cipote de los mandados",
        "confirmation_message_received": "¡Cabal! Recibí tu mensaje. Aquí está lo que mandaste:",
        "confirmation_delivered": "Ya le di tu mensaje a Isaac. Él se pondrá en contacto con vos lo más pronto posible.",
        "confirmation_thanks": "¡Gracias por tu interés y por escribirle!",
        "confirmation_footer": "Este es un mensaje automático del IsaBot. No le respondás a este correo.",
        "message_placeholder": "Escribí tu mensaje aquí...",
        "send_button": "Mandar",
        "success_title": "¡Chivo!",
        "success_message": "Gracias por tu mensaje, revisá tu correo, te mandamos un email con la confirmación. Si no lo hallás, revisá bien la dirección que pusiste.",
        "error_captcha": "¡Chis! Hubo un error, intentá de nuevo.",
        "error_message": "Hubo un clavo al mandar tu mensaje, intentá más tarde."
    },
    "chat": {
        "bot_name": "ISA BOT",
        "i_am_bot_message": "Soy el asistente virtual de Isaac, ¿en qué te puedo ayudar?",
        "its_a_pleasure": "¡Un gusto ayudarte!",
        "askme_placeholder": "Preguntame algo sobre Isaac",
        "error_chatting": "¡Chis! Hubo un error.",
        "error_response": "Hubo un error al recibir la respuesta, intentá de nuevo más tarde.",
        "hit_limit_1": "Parece que ya te acabaste las preguntas.",
        "hit_limit_2": "Vaya, parece que ya no podés chatear más por hoy. Probá mañana.",
        "captcha_message": "Porfa, marcá la casilla para seguir.",
        "mistakes": "ISA BOT a veces se equivoca."
    },
    "cookies": {
        "message": "Usamos cookies para que la página te funcione más chivo. Si seguís navegando, aceptás que las usemos.",
        "accept": "Aceptar",
        "policy": "Política de Privacidad"
    },
    "policy": {
        "title": "Política de Privacidad",
        "last_updated": "Última actualización: agosto de 2025",
        "introduction_title": "Introducción",
        "introduction_text": "Esta Política de Privacidad describe cómo recopilamos, usamos y divulgamos su información.",
        "cookies_title": "Cookies",
        "cookies_text": "Utilizamos cookies para operar y mejorar nuestros servicios. Una cookie es un pequeño dato almacenado en su dispositivo. Usamos una cookie 'lang' para almacenar su preferencia de idioma y una cookie 'browser_id' para identificar de forma única su navegador con fines de análisis y seguridad.",
        "data_title": "Recopilación y Uso de Datos",
        "data_text": "Cuando utiliza nuestro formulario de contacto o chat, recopilamos su nombre, correo electrónico y el contenido de su mensaje, junto con sus cookies 'browser_id' y 'lang'. Estos datos se utilizan para responder a sus consultas y mejorar nuestros servicios."
    }
}