{
  "locale":"es-sv",
  "name":"Isaac Ramirez",
  "tagline":"Innovando soluciones tecnológicas para un futuro conectado",
  "content": [
  {"title": "Informacion personal",
    "details": [
      {"show": true, "type": "keyvalue", "key": "Email", "value": "hello@isawilddev.com"},
      {"show": true, "type": "keyvalue", "key": "Phone", "value": "+50373120512"},
      {"show": true, "type": "keyvalue", "key": "Location", "value": "El Salvador"},
      {"show": true, "type": "keyvalue", "key": "Degree", "value": "Ingeniería en Sistemas y Computación"},
      {"show": true, "type": "keyvalue", "key": "Age", "value": "25"},
      {"show": false, "type": "keyvalue", "key": "Date of Birth", "value": "2000-03-24"}
    ]
  },
  {"title": "Resumen profesional",
    "details": [
      {"show": true, "type": "text", "value": "Desarrollador Fullstack con experiencia en la migración de aplicaciones monolíticas a microservicios, implementación en la nube (Azure) y desarrollo de soluciones de experiencia del cliente. Con experiencia en liderar equipos técnicos y aplicar IA/ML, IoT y Big Data en contextos industriales."}
    ]
  },
  {"title": "Idiomas",
    "details": [
      {"show": true, "type": "keyvalue", "key": "Español", "value": "Nativo"},
      {"show": true, "type": "keyvalue", "key": "Inglés", "value": "Intermedio B1-B2"}
    ]
  },
  {"title": "Redes sociales",
    "details": [
      {"show": true, "type": "link", "platform": "linkedin", "user": "isaacramirez-net"},
      {"show": true, "type": "link", "platform": "github", "user": "isawilddev"}

    ]
  },
  {"title": "Áreas fuertes",
    "details": [
      {"show": true, "type": "text", "value": "Frontend"},
      {"show": true, "type": "text", "value": "Backend"},
      {"show": true, "type": "text", "value": "Base de datos"},
      {"show": true, "type": "text", "value": "IA"}
    ]
  },
  {"title": "Intereses",
    "details": [
      {"show": true, "type": "text", "value": "Entusiasta de IA"},
      {"show": true, "type": "text", "value": "LLM RAG"},
      {"show": true, "type": "text", "value": "IoT"}
    ]
  }
],
"extra_insights": [
    {
      "show":false,
      "title": "Enfoque en la Resolución de Problemas",
      "description": "Mi enfoque para la resolución de problemas se caracteriza por la adaptabilidad y una mentalidad de 'nunca dejar de aprender'. No temo salir de mi zona de confort para abordar los desafíos, como lo demostré al pasar de la programación a la instalación física de infraestructura de red y cámaras en mi primer empleo. En mi segundo trabajo, contratado para implementar, rápidamente dominé el desarrollo de quioscos de autogestión, perfeccionando prácticas existentes y logrando la adaptabilidad en diversas pantallas, lo que me permitió liderar proyectos con grandes marcas. Esta capacidad de aprender sobre la marcha, como con la arquitectura SOA, es fundamental en mi metodología, siempre buscando soluciones efectivas y tangibles."
    },
    {
      "show":false,
      "title": "Impacto de Mi Trabajo",
      "description": "Busco que mi trabajo tenga un impacto positivo y medible. En mis roles, he contribuido directamente a: aumentar la productividad del equipo mediante la optimización de procesos; acelerar la entrega de software a través de mejoras en los ciclos de desarrollo; impulsar el crecimiento de capacidades de desarrollo dentro de la empresa; mejorar la percepción del cliente a través de soluciones robustas y eficientes, lo que llevó a clientes clave a solicitar mi asistencia específicamente (ACF, Datum); y simplificar la comunicación interna al convertirme en el punto de contacto técnico preferido por los empleados para soporte en mis roles."
    },
    {
      "show":false,
      "title": "Valores y Estilo de Trabajo",
      "description": "Mi ética de trabajo está profundamente arraigada en mis valores de honestidad, bondad, responsabilidad y compromiso. Abordo cada proyecto con gran cuidado, especialmente cuando manejo datos sensibles de clientes. Mi experiencia previa en construcción me ha dotado de una perspectiva única para la resolución de problemas y una creatividad práctica en el desarrollo. Mi fe en Dios me inspira a utilizar mis habilidades para ayudar a los demás a través de la tecnología, buscando siempre construir soluciones que no solo funcionen, sino que también sirvan a un propósito mayor."
    }]
  }
