{
  "locale": "es-sv",
  "name": "Isaac Ramirez",
  "tagline": "Innovando con soluciones tecnológicas para un futuro chivo",
  "content": [
    {
      "title": "Info personal",
      "details": [
        {"show": true, "type": "keyvalue", "key": "Correo", "value": "hello@isawilddev.com"},
        {"show": true, "type": "keyvalue", "key": "Teléfono", "value": "+50373120512"},
        {"show": true, "type": "keyvalue", "key": "Ubicación", "value": "El Salvador"},
        {"show": true, "type": "keyvalue", "key": "Título", "value": "Ingeniería en Sistemas y Computación"},
        {"show": true, "type": "keyvalue", "key": "Edad", "value": "25"},
        {"show": false, "type": "keyvalue", "key": "Fecha de Nacimiento", "value": "2000-03-24"}
      ]
    },
    {
      "title": "Resumen profesional",
      "details": [
        {"show": true, "type": "text", "value": "Desarrollador Fullstack con maña para migrar aplicaciones monolíticas a microservicios, implementación en la nube (Azure) y desarrollo de soluciones de experiencia de cliente. Con experiencia liderando equipos técnicos y aplicando IA/ML, IoT y Big Data en movidas industriales."}
      ]
    },
    {
      "title": "Idiomas",
      "details": [
        {"show": true, "type": "keyvalue", "key": "Español", "value": "Nativo"},
        {"show": true, "type": "keyvalue", "key": "Inglés", "value": "Intermedio B1-B2"}
      ]
    },
    {
      "title": "Redes sociales",
      "details": [
        {"show": true, "type": "link", "platform": "linkedin", "user": "isaacramirez-net"},
        {"show": true, "type": "link", "platform": "github", "user": "isawilddev"}
      ]
    },
    {
      "title": "Áreas fuertes",
      "details": [
        {"show": true, "type": "text", "value": "Frontend"},
        {"show": true, "type": "text", "value": "Backend"},
        {"show": true, "type": "text", "value": "Bases de datos"},
        {"show": true, "type": "text", "value": "IA"}
      ]
    },
    {
      "title": "Intereses",
      "details": [
        {"show": true, "type": "text", "value": "Entusiasta de la IA"},
        {"show": true, "type": "text", "value": "LLM RAG"},
        {"show": true, "type": "text", "value": "IoT"}
      ]
    }
  ],
  "extra_insights": [
    {
      "show": false,
      "title": "Mi forma de resolver problemas",
      "description": "Mi manera de resolver clavos se basa en ser flexible y en la idea de que 'nunca hay que dejar de aprender'. No me da miedo salirme de lo que ya conozco para enfrentar nuevos retos, como cuando pasé de programar a instalar cables de red y cámaras en mi primer chance. En mi segundo trabajo, me contrataron para implementar y al poco tiempo ya le hacía al desarrollo de quioscos de autogestión, mejorando lo que ya había y haciendo que funcionara en un montón de pantallas distintas, lo que me dejó liderar proyectos con marcas grandes. Esa onda de aprender sobre la marcha, como me pasó con la arquitectura SOA, es clave en mi forma de trabajar, siempre buscando soluciones que sirvan y se puedan ver."
    },
    {
      "show": false,
      "title": "El impacto de mi trabajo",
      "description": "Busco que mi trabajo deje una huella positiva y que se note. En mis puestos, he ayudado directamente a: que el equipo sea más productivo, optimizando cómo hacemos las cosas; entregar el software más rápido, mejorando los ciclos de desarrollo; hacer crecer las capacidades de desarrollo en la empresa; que los clientes nos vean con mejores ojos gracias a soluciones buenas y eficientes, lo que hizo que clientes importantes pidieran que yo les ayudara (ACF, Datum); y hacer más fácil la comunicación interna, volviéndome el contacto técnico al que todos buscaban para pedir ayuda."
    },
    {
      "show": false,
      "title": "Valores y mi estilo de jale",
      "description": "Mi ética de trabajo viene de mis valores: la honestidad, la buena onda, la responsabilidad y el compromiso. Cada proyecto lo agarro con mucho cuidado, más si hay datos delicados de clientes. Mi experiencia anterior en construcción me ha dado una forma distinta de ver los problemas y una creatividad práctica para desarrollar. Mi fe en Dios me mueve a usar mis talentos para ayudar a otros con la tecnología, buscando siempre hacer soluciones que no solo funcionen, sino que sirvan para algo más grande."
    }
  ]
}