{
  "jobs_history": [
    {
      "type": "empresa",
      "company": "Datum Redsoft SV",
      "description": "Ofrece soluciones chivas de consultoría, soporte técnico y transformación digital para un montón de industrias en Centroamérica, respaldadas por alianzas estratégicas como partner oficial de Red Hat y Oracle.",
      "logo_url": "datumredsoftsv.png",
      "resume":"Soy un mero macizo en la arquitectura y desarrollo de soluciones tecnológicas, con maña para el desarrollo y migración de aplicaciones monolíticas a microservicios y otras arquitecturas. Le echo la mano al equipo de desarrollo del cliente, enfocado en la mejora y optimización de procesos y la adopción de nuevas tecnologías y técnicas modernas para que la transformación digital y modernización de la infraestructura del gobierno de El Salvador vaya al pelo, aprovechando al máximo los recursos en su yunta con Google.",
      "orden": 1,
      "job_roles": [
        {
          "job_role": "Especialista en Desarrollo",
          "job_role_id": 4,
          "start_date": "2025-01-29",
          "end_date": null,
          "actually": true,
          "responsabilities": [
            {"description":"Consultoría en arquitectura y desarrollo de soluciones tecnológicas."},
            {"description":"Diseño de arquitecturas de software que aguanten y sean eficientes."},
            {"description":"Desarrollo e implementación de soluciones tecnológicas."},
            {"description":"Pasar aplicaciones monolíticas a microservicios."},
            {"description":"Montar servidores y ambientes para los despliegues."},
            {"description":"Armar y mantener pipelines de CI/CD."},
            {"description":"Estar pendiente y controlar los despliegues y las movidas."}
          ]
        }
      ],
      "projects": [
        {
          "project_name": "Migración del módulo de Pagos",
          "implementation_type": "En la casa (On-premise)",
          "company": "Secretaría de Estado (SEDE) - Ministerio de Hacienda",
          "company_logo_path": "escudoelsalvador.png",
          "highlight": true,
          "project_description": {
            "description": "Migración y enchulada del módulo de pagos de una aplicación viejita en Java 8/Primefaces a una arquitectura más moderna con microservicios y un frontend por su lado.",
            "bullet_points": [
              "Echarle un ojo a la aplicación viejita (Java 8, Primefaces).",
              "Pensar y armar la nueva arquitectura con microservicios.",
              "Pasar el backend a Java 17 con Spring Boot (tres capas).",
              "Hacer un frontend aparte con React y Bootstrap.",
              "Implementar otro backend para los reportes.",
              "Usar JBoss EAP 8 como servidor de aplicaciones.",
              "Integrar Axios para hablar con las APIs REST.",
              "Volver a hacer y pasar los chunches de la base de datos Oracle SQL.",
              "Comunicación entre servicios usando REST.",
              "Controlar las versiones y el CI/CD con Tuleap, Jenkins y Gerrit.",
              "Entrar y desplegar de forma segura con SSH.",
              "Hacer pruebas unitarias con JUnit (backend) y Jest (frontend)."
            ]
          },
          "technologies": [21, 22, 23, 1, 2, 29, 24, 34, 35, 36, 37, 13, 38, 39, 46, 62, 64],
          "project_role_timeline": [
            {
              "role": 4,
              "start_date": "2025-02-01",
              "end_date": "2025-06-30"
            }
          ],
          "orden": 20250201,
          "project_id": 20
        },
        {
          "project_name": "Migración del Control de Saldos de Cuentas",
          "implementation_type": "En la casa (On-premise)",
          "company": "Dirección General de Tesorería (DGT) - Ministerio de Hacienda El Salvador",
          "company_logo_path": "escudoelsalvador.png",  
          "highlight": true,
          "project_description": {
            "description": "Poner al día los procesos de integración bancaria para ver los saldos de las cuentas del gobierno, cambiando los viejos procesos de FTP por una arquitectura moderna con APIs, mensajería y orquestación SOA.\n\nFase 1: Rediseño y desarrollo de los procesos para las tramas 6, 7 y 8, con APIs de encolamiento y procesamiento, integración con SOA BPEL, validaciones más chivas y notificaciones automáticas.\nFase 2: Dejar lista la arquitectura y los procesos para una futura migración a OpenShift.",
            "bullet_points": [
              "Diseñar la nueva arquitectura pensando en pasarla a OpenShift después.",
              "Identificar y rediseñar los procesos para las tramas 6 (cargos/abonos), 7 (apertura/cierre de cuentas) y 8 (análisis de rentabilidades).",
              "Desarrollar APIs para encolar y procesar los mensajes de cada trama.",
              "Implementar una API intermedia que escuche y mande los mensajes de la cola.",
              "Integrar con SOA BPEL para validar bien y procesar los datos.",
              "Automatizar la metida de datos en Oracle SQL Database con BPEL.",
              "Hacer la lógica para ver qué hacer con los resultados: si todo bien (mandar correo con REST/SMTP) o si hay clavo (hacer un JSON y mandarlo por FTP).",
              "Desarrollar servicios REST para notificaciones automáticas.",
              "Configurar y desplegar las APIs en WebLogic y SOA BPEL en EM.",
              "Crear y migrar los chunches necesarios en la base de datos Oracle SQL.",
              "Usar Spring Boot, Java Middleware, JMS, XML, JSON, REST y SOAP.",
              "Controlar las versiones y colaborar con Tuleap y Gerrit.",
              "Desarrollar y probar en servidores Linux, usando herramientas como JDeveloper, Gemini CLI, Cursor, VSCode, Codex (OpenAI) y MobaXterm SSH."
            ]
          },
          "technologies": [22, 24, 34, 40, 41, 42, 43, 44, 13, 35, 37, 45, 46, 47, 48, 49, 50, 51, 52, 1, 2, 62, 64],
          "project_role_timeline": [
            {
              "role": 4,
              "start_date": "2025-03-01",
              "end_date": "2025-11-30"
            }
          ],
          "orden": 20250301,
          "project_id": 21
        },
        {
  "project_name": "SIERO - Sistema para Evaluar Riesgos del Chance",
  "implementation_type": "En la casa (On-premise)",
  "company": "Secretaría de Estado (SEDE) - Ministerio de Hacienda",
  "company_logo_path": "escudoelsalvador.png",
  "highlight": true,
  "project_description": {
    "description": "Consultoría y desarrollo en la creación del Sistema de Evaluación de Riesgos Ocupacionales (SIERO). Mi jale se centra en definir la arquitectura para el versionamiento de las evaluaciones, que se organizan por edificio, unidad y puesto. También estoy ayudando a hacer los módulos para todo el ciclo de una evaluación, desde que se crea y se revisa hasta que se guarda la versión final.",
    "bullet_points": [
      "Dar ideas para la arquitectura del versionamiento de las evaluaciones.",
      "Diseñar cómo va a ser todo el rollo de las evaluaciones de riesgo (crear, revisar, guardar versión).",
      "Hacer los formularios y la lógica para manejar las evaluaciones.",
      "Implementar el backend con Spring Boot.",
      "Hacer la interfaz de usuario con React y Bootstrap.",
      "Armar la lógica para manejar la jerarquía de edificio, unidad y puesto."
    ]
  },
  "technologies": [21, 22, 23, 1, 2, 29, 24, 34, 35, 36, 37, 13, 38, 39, 46, 62, 64, 160],
  "project_role_timeline": [
    {
      "role": 4,
      "start_date": "2025-07-01",
      "end_date": null
    }
  ],
  "orden": 20250701,
  "project_id": 22
}
      ]
    },
    {
      "type": "empresa",
      "company": "ACF Technologies LATAM",
      "description": "Mejora la experiencia del cliente con soluciones a la medida para gestionar citas, atención y flujos de servicio para diferentes clientes de varias industrias.",
      "logo_url": "acftechnologieslatam.png",
      "resume":"Soy bueno para desarrollar e implementar soluciones a la medida, sobre todo para mejorar la atención al cliente, la gestión de citas, las colas y los procesos de chance de las empresas. Hice soluciones para integrar plataformas de la empresa y de otros, y también con fuentes de datos. Al final, las empresas tienen un flujo de trabajo más chivo y productivo, con clientes más contentos y más ganancias.",
      "orden": 3,
      "job_roles": [
        {
          "job_role": "Gerente de Proyectos",
          "job_role_id": 3,
          "responsabilities": [
            {"description":"Levantar y planificar los proyectos."},
            {"description":"Gestionar los proyectos y ver cómo van los resultados."},
            {"description":"Coordinar reuniones con el cliente para diferentes cosas."}
          ],
          "start_date": "2024-08-18",
          "end_date": "2025-01-24"
        },
        {
          "job_role": "Ingeniero Desarrollador",
          "show_first": true,
          "job_role_id": 2,
          "responsabilities": [
            {"description":"Arquitectura y desarrollo de soluciones tecnológicas para optimizar los procesos de atención al cliente y mejorar la experiencia del usuario."},
            {"description": "Desarrollo de aplicaciones frontend y backend."},
            {"description": "Desarrollo de integraciones con sistemas de la empresa y de otros (SSO, ERP, CRM, etc.)."},
            {"description": "Diseño y desarrollo de módulos de bases de datos."},
            {"description": "Desarrollo de scripts de integración y bases de datos."},
            {"description": "Crear y mantener la infraestructura en la nube de Azure para los clientes de ACF."}
          ],
          "start_date": "2023-07-18",
          "end_date": "2025-01-24"
        },
        {
          "job_role": "Ingeniero Implementador",
          "job_role_id": 1,
          "responsabilities": [
            { "description": "Analizar y recoger los requerimientos técnicos y funcionales con el Gerente de Proyectos para definir qué tanto se va a hacer." },
            { "description": "Gestionar e implementar soluciones en diferentes infraestructuras, como en la casa (on-premise), en la nube y SaaS, para que todo se integre y funcione bien." },
            { "description": "Enseñar a los usuarios a usar las soluciones que implementamos." },
            { "description": "Estar pendiente y darle mantenimiento a las soluciones para que funcionen bien y se mejoren siempre." }
          ],
          "start_date": "2023-03-18",
          "end_date": "2024-08-24"
        }
      ],
      "projects": []
    },
    {
      "type": "estudio",
      "company": "Universidad Tecnológica de El Salvador",
      "description": "Carrera de Ingeniería en Sistemas y Computación",
      "logo_url": "utec.png",
      "orden": 8,
      "skills": [121, 122, 123, 124, 125, 127, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144],
      "job_roles": [
        {
          "job_role": "Estudiante de Ingeniería en Sistemas y Computación",
          "job_role_id": 1001,
          "start_date": "2018-01-01",
          "end_date": "2023-12-31",
          "actually": false,
          "responsabilities": [
            {"description": "Por tres años, di tutorías de algoritmos, POO y lógica a los bichos de nuevo ingreso, lo que me ayudó a ponerme más macizo en lo técnico y a liderar grupos de más de 50 estudiantes."},
            {"description": "Desarrollo de maña para programar, estructuras de datos, algoritmos y arquitectura de computadoras."},
            {"description": "Aprender a diseñar y manejar bases de datos, sistemas operativos y redes."},
            {"description": "Hacer software siguiendo metodologías ágiles y buenas prácticas."},
            {"description": "Trabajar en equipo, hablar claro y resolver clavos."},
            {"description": "Gestionar proyectos, planificar y organizar bien el tiempo."},
            {"description": "Pensar críticamente y analizar para tomar decisiones técnicas."},
            {"description": "Siempre estar aprendiendo y adaptándome a nuevas tecnologías y lenguajes."},
            {"description": "Investigar y aplicar buenas prácticas de desarrollo, seguridad y experiencia de usuario."}
          ]
        }
      ],
      "projects": []
    },
    {
      "type": "logro",
      "company": "Graduación de Ingeniería en Sistemas y Computación",
      "description": "",
      "logo_url": "utec.png",
      "orden": 4,
      "job_roles": [
        {
          "job_role": "Grado de Ingeniero en Sistemas y Computación",
          "job_role_id": 1003,
          "start_date": "2025-05-30",
          "end_date": "2025-05-30",
          "actually": false,
          "responsabilities": []
        }
      ],
      "projects": []
    },
    {
      "type": "logro",
      "company": "Ministerios Juveniles Adventistas, División Interamericana",
      "description": "Currículo de Liderazgo para Embajadores y Líderes de Jóvenes Adultos",
      "logo_url": "liderjuvenil.png",
      "orden": 7,
      "skills": [107, 108, 109, 110, 111, 112, 113],
      "job_roles": [
        {
          "job_role": "Líder Juvenil Certificado (Mentor)",
          "job_role_id": 1015,
          "start_date": "2021-01-01",
          "end_date": "2021-12-31",
          "responsabilities": [
            {"description": "Entender la historia, la filosofía, la visión, los objetivos y cómo está armado el Ministerio Juvenil Adventista."
            },{"description": "Desarrollar la maña para entender y adaptarse a los jóvenes de ahora, incluyendo el rollo digital."
            },{"description": "Ser un líder espiritual, aconsejar y ser amigo de los jóvenes, siendo un ejemplo de Cristo."
            },{"description": "Hacer que los jóvenes se sientan parte y darles poder en la iglesia, delegando responsabilidades."
            },{"description": "Planificar las cosas de la iglesia con un propósito, usando las cuatro fuerzas de la Biblia (Gracia, Adoración, Comunidad, Servicio)."
            },{"description": "Hacer programas para jóvenes que sean creativos, balanceados y que vayan con los temas del año de los Ministerios Juveniles."
            },{"description": "Descubrir, animar y usar los dones espirituales de los jóvenes para servir y ayudar a la iglesia."
            },{"description": "Aprovechar al máximo las oportunidades y evitar los peligros de las redes sociales en el ministerio digital."
            }     ]
        }
      ],
      "projects": []
    }
  ]
}