{
  "locale": "en-us",
  "name": "Isaac Ramirez",
  "tagline": "AI & Fullstack Engineer",
  "content": [
    {
      "title": "Personal Information",
      "details": [
        {"show": true, "type": "keyvalue", "key": "Email", "value": "hello@isawilddev.com"},
        {"show": true, "type": "keyvalue", "key": "Location", "value": "El Salvador"},
        {"show": true, "type": "keyvalue", "key": "Degree", "value": "Systems and Computer Engineering"},
        {"show": true, "type": "keyvalue", "key": "Age", "value": "25"},
        {"show": false, "type": "keyvalue", "key": "Date of Birth", "value": "2000-03-24"}
      ]
    },
    {
      "title": "Professional Summary",
      "details": [
        {"show": true, "type": "text", "value": "AI Engineer and Full-Stack Developer with over 5 years of experience developing enterprise solutions. For more than a year, I've been focused on taking AI beyond simple APIs to tackle complex business challenges. My expertise lies in modernizing monolithic applications into microservices architectures and deploying solutions in the cloud (Azure). I specialize in building agentic systems with LLM frameworks like LangChain and Vercel AI SDK, and optimizing models using RAG (Retrieval-Augmented Generation) and fine-tuning techniques. My approach is to combine advanced programming skills with strategic thinking to design, build, and deploy innovative solutions that optimize business processes."}
      ]
    },
    {
      "title": "Languages",
      "details": [
        {"show": true, "type": "keyvalue", "key": "Spanish", "value": "Native"},
        {"show": true, "type": "keyvalue", "key": "English", "value": "Intermediate B1-B2"}
      ]
    },
    {
      "title": "Social Networks",
      "details": [
        {"show": true, "type": "link", "platform": "linkedin", "user": "isaacramirez-net"},
        {"show": true, "type": "link", "platform": "github", "user": "isawilddev"}
      ]
    },
    {
      "title": "Strong Areas",
      "details": [
        {"show": true, "type": "text", "value": "Frontend"},
        {"show": true, "type": "text", "value": "Backend"},
        {"show": true, "type": "text", "value": "Database"},
        {"show": true, "type": "text", "value": "AI"}
      ]
    },
    {
      "title": "Interests",
      "details": [
        {"show": true, "type": "text", "value": "AI Enthusiast"},
        {"show": true, "type": "text", "value": "LLM RAG"},
        {"show": true, "type": "text", "value": "IoT"}
      ]
    }
  ],
  "extra_insights": [
    {
      "show": false,
      "title": "Problem-Solving Approach",
      "description": "My approach to problem-solving is characterized by adaptability and a 'never stop learning' mindset. I am not afraid to step out of my comfort zone to tackle challenges, as demonstrated when I moved from programming to the physical installation of network infrastructure and cameras in my first job. In my second job, hired for implementation, I quickly mastered the development of self-service kiosks, perfecting existing practices and achieving adaptability across various screens, which allowed me to lead projects with major brands. This ability to learn on the fly, as with SOA architecture, is fundamental to my methodology, always seeking effective and tangible solutions."
    },
    {
      "show": false,
      "title": "Impact of My Work",
      "description": "I strive for my work to have a positive and measurable impact. In my roles, I have directly contributed to: increasing team productivity by optimizing processes; accelerating software delivery through improvements in development cycles; driving the growth of development capabilities within the company; improving client perception through robust and efficient solutions, which led key clients to specifically request my assistance (ACF, Datum); and simplifying internal communication by becoming the preferred technical point of contact for employees for support in my roles."
    },
    {
      "show": false,
      "title": "Values and Work Style",
      "description": "My work ethic is deeply rooted in my values of honesty, kindness, responsibility, and commitment. I approach each project with great care, especially when handling sensitive client data. My previous experience in construction has given me a unique perspective on problem-solving and practical creativity in development. My faith in God inspires me to use my skills to help others through technology, always seeking to build solutions that not only work but also serve a greater purpose."
    }
  ]
}