{
  "jobs_history": [
    {
      "type": "company",
      "company": "Datum Redsoft SV",
      "description": "Offers innovative consulting, technical support, and digital transformation solutions for multiple industries in Central America, backed by strategic alliances as an official partner of Red Hat and Oracle.",
      "logo_url": "datumredsoftsv.png",
      "resume": "Expert in the architecture and development of technological solutions, specializing in the development and migration of monolithic applications to microservices and other architectures. I provide consulting to the client's development team, focused on process improvement and optimization, and the adoption of new technologies and modern techniques to streamline the digital transformation and modernization of El Salvador's government infrastructure, making the most of resources in its alliance with Google.",
      "orden": 1,
      "job_roles": [
        {
          "job_role": "Development Specialist",
          "job_role_id": 4,
          "start_date": "2025-01-29",
          "end_date": null,
          "actually": true,
          "responsabilities": [
            {"description": "Consulting in architecture and development of technological solutions."},
            {"description": "Design of scalable and efficient software architectures."},
            {"description": "Development and implementation of technological solutions."},
            {"description": "Migrate monolithic applications to microservices."},
            {"description": "Configure servers and environments for deployments."},
            {"description": "Configure and maintain CI/CD pipelines."},
            {"description": "Monitoring and control of deployments and operations."}
          ]
        }
      ],
      "projects": [
        {
          "project_name": "PAYMENTS Module Migration",
          "implementation_type": "On-premise",
          "company": "State Secretariat (SEDE) - Ministry of Finance",
          "company_logo_path": "escudoelsalvador.png",
          "highlight": true,
          "project_description": {
            "description": "Migration and modernization of the payments module from a monolithic Java 8/Primefaces application to a modern architecture based on microservices and a decoupled frontend.",
            "bullet_points": [
              "Preliminary analysis of the original monolithic application (Java 8, Primefaces).",
              "Design and structuring of the new microservices-based architecture.",
              "Backend migration to Java 17 with Spring Boot (three layers).",
              "Development of a decoupled frontend with React and Bootstrap.",
              "Implementation of an additional backend for reporting.",
              "Use of JBoss EAP 8 as the application server.",
              "Integration of Axios for consuming REST APIs.",
              "Re-creation and migration of objects in Oracle SQL Database.",
              "Communication between services via REST.",
              "Version control and CI/CD with Tuleap, Jenkins, and Gerrit.",
              "Secure access and deployment via SSH.",
              "Unit tests with JUnit (backend) and Jest (frontend)."
            ]
          },
          "technologies": [21, 22, 23, 1, 2, 29, 24, 34, 35, 36, 37, 13, 38, 39, 46, 62, 64],
          "project_role_timeline": [
            {
              "role": 4,
              "start_date": "2025-02-01",
              "end_date": "2025-06-30"
            }
          ],
          "orden": 20250201,
          "project_id": 20
        },
        {
          "project_name": "Bank Account Balance Control Migration",
          "implementation_type": "On-premise",
          "company": "General Treasury Directorate (DGT) - Ministry of Finance El Salvador",
          "company_logo_path": "escudoelsalvador.png",
          "highlight": true,
          "project_description": {
            "description": "Modernization of banking integration processes for controlling account balances of government institutions, migrating from traditional FTP processes to a modern architecture based on APIs, messaging, and SOA orchestration.\n\nPhase 1: Redesign and development of integration processes for frames 6, 7, and 8, with queuing and processing APIs, integration with SOA BPEL, advanced validations, and automatic notifications.\nPhase 2: Preparation of the architecture and processes for future migration to OpenShift.",
            "bullet_points": [
              "Design of the new architecture considering future migration to OpenShift.",
              "Identification and redesign of integration processes for frames 6 (charges/credits), 7 (account opening/closing), and 8 (profitability analysis).",
              "Development of queuing and message processing APIs for each frame.",
              "Implementation of an intermediate API for listening and routing queue messages.",
              "Integration with SOA BPEL for granular validation and data processing.",
              "Automation of data insertion into Oracle SQL Database via BPEL.",
              "Development of logic for handling results: success (email sending via REST/SMTP) and inconsistencies (generation of JSON file and sending via FTP).",
              "Development of REST services for automatic notifications.",
              "Configuration and deployment of APIs on WebLogic and SOA BPEL in EM.",
              "Creation and migration of necessary objects in Oracle SQL Database.",
              "Use of Spring Boot, Java Middleware, JMS, XML, JSON, REST, and SOAP.",
              "Version control and collaboration with Tuleap and Gerrit.",
              "Development and testing in Linux Server environments, using tools like JDeveloper, Gemini CLI, Cursor, VSCode, Codex (OpenAI), and MobaXterm SSH."
            ]
          },
          "technologies": [22, 24, 34, 40, 41, 42, 43, 44, 13, 35, 37, 45, 46, 47, 48, 49, 50, 51, 52, 1, 2, 62, 64],
          "project_role_timeline": [
            {
              "role": 4,
              "start_date": "2025-03-01",
              "end_date": "2025-11-30"
            }
          ],
          "orden": 20250301,
          "project_id": 21
        },
        {
          "project_name": "SIERO - Occupational Risk Assessment System",
          "implementation_type": "On-premise",
          "company": "State Secretariat (SEDE) - Ministry of Finance",
          "company_logo_path": "escudoelsalvador.png",
          "highlight": true,
          "project_description": {
            "description": "Consulting and development in the creation of the Occupational Risk Assessment System (SIERO). My participation focuses on defining the architecture for versioning the assessments, which are structured hierarchically by building, unit, and position. Additionally, I am co-developing the modules for the complete lifecycle of an assessment, from its creation and verification to its final versioning.",
            "bullet_points": [
              "Consulting on the architecture for versioning complex assessments.",
              "Design of the risk assessment lifecycle (creation, verification, versioning).",
              "Development of forms and business logic for assessment management.",
              "Backend implementation with Spring Boot.",
              "User interface development with React and Bootstrap.",
              "Structuring logic to handle the building, unit, and position hierarchy."
            ]
          },
          "technologies": [21, 22, 23, 1, 2, 29, 24, 34, 35, 36, 37, 13, 38, 39, 46, 62, 64, 160],
          "project_role_timeline": [
            {
              "role": 4,
              "start_date": "2025-07-01",
              "end_date": null
            }
          ],
          "orden": 20250701,
          "project_id": 22
        }
      ]
    },
    {
      "type": "company",
      "company": "ACF Technologies LATAM",
      "description": "Improves customer experience through customized solutions for appointment management, service, and workflows for different clients in various industries.",
      "logo_url": "acftechnologieslatam.png",
      "resume": "Specialized in the development and implementation of tailored solutions, with an emphasis on improving customer service, appointment management, queues, and business work processes. I developed integration solutions between enterprise and third-party platforms, as well as with data sources. This resulted in more efficient and productive workflows for companies, with higher customer satisfaction and greater profitability of business processes.",
      "orden": 3,
      "job_roles": [
        {
          "job_role": "Project Manager",
          "job_role_id": 3,
          "responsabilities": [
            {"description": "Project scoping and planning."},
            {"description": "Project management and results tracking."},
            {"description": "Coordination of client meetings for various objectives."}
          ],
          "start_date": "2024-08-18",
          "end_date": "2025-01-24"
        },
        {
          "job_role": "Development Engineer",
          "show_first": true,
          "job_role_id": 2,
          "responsabilities": [
            {"description": "Architecture and development of technological solutions aimed at optimizing customer service processes and improving the end-user experience."},
            {"description": "Development of frontend and backend applications."},
            {"description": "Development of integrations with enterprise and third-party systems (SSO, ERP, CRM, etc.)."},
            {"description": "Design and development of database modules."},
            {"description": "Development of integration and database scripts."},
            {"description": "Creation and maintenance of cloud infrastructure on Azure for ACF clients."}
          ],
          "start_date": "2023-07-18",
          "end_date": "2025-01-24"
        },
        {
          "job_role": "Implementation Engineer",
          "job_role_id": 1,
          "responsabilities": [
            {"description": "Analysis and collection of technical and functional requirements in collaboration with the Project Manager to define the project scope."},
            {"description": "Management and implementation of solutions in multiple infrastructure environments, including on-premise, cloud, and SaaS models, ensuring proper integration and functionality."},
            {"description": "Train end-users in the use of the implemented solutions."},
            {"description": "Continuous monitoring and maintenance of implemented solutions to ensure their proper functioning and ongoing optimization."}
          ],
          "start_date": "2023-03-18",
          "end_date": "2024-08-24"
        }
      ],
      "projects": [
        {
          "project_name": "Qflow Pilot Implementation",
          "implementation_type": "ACF Cloud hosted",
          "company": "Emcali Colombia",
          "company_logo_path": "emcalicolombia.png",
          "project_description": {
            "description": "Pilot implementation of the Q-flow queue management system. Configuration of servers in ACF's Azure cloud and deployment of the platform.",
            "bullet_points": [
              "Configuration of Windows Server servers on Azure.",
              "Configuration of SQL Server instance on Azure.",
              "Deployment of the Q-flow platform."
            ]
          },
          "technologies": [17, 11, 9, 4, 12, 13, 14, 48, 63],
          "project_role_timeline": [
            {
              "role": 1,
              "start_date": "2023-04-01",
              "end_date": "2023-06-01"
            }
          ],
          "orden": 20230401,
          "project_id": 1
        },
        {
          "project_name": "Qflow Integration with Microsoft Dynamics 365",
          "implementation_type": "ACF Cloud hosted",
          "company": "Asesuisa El Salvador",
          "company_logo_path": "asesuisaelsalvador.png",
          "project_description": {
            "description": "Asesuisa needed to improve customer service processes and enhance the end-user experience. To achieve this, a queue management system was implemented to optimize service flows and improve the user experience.",
            "bullet_points": [
              "Optimization of customer service flows.",
              "Development of integration scripts between platforms.",
              "Configuration of IIS servers in ACF's Azure cloud.",
              "Implementation of a self-service kiosk for queues and appointments.",
              "Implementation of the 'Infopage' module.",
              "Training for end-users on system usage."
            ]
          },
          "technologies": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 48, 63],
          "project_role_timeline": [
            {
              "role": 1,
              "start_date": "2023-04-01",
              "end_date": "2023-07-01"
            }
          ],
          "orden": 20230401,
          "project_id": 2
        },
        {
          "project_name": "Queue System Version Migration 5.7 to 6.2",
          "implementation_type": "On-premise",
          "company": "Tigo Bolivia",
          "company_logo_path": "tigobolivia.png",
          "project_description": {
            "description": "Version migration of Tigo Bolivia's queue management system from version 5.7 to 6.2, which required an exhaustive evaluation of compatibility between system components and their integrations.",
            "bullet_points": [
              "Configuration of IIS Windows Servers in the client's infrastructure.",
              "Configuration of load balancers in the client's infrastructure.",
              "Version migration of integration components from 5.7 to 6.2.",
              "Version migration of the queue management system and associated integrations.",
              "Version migration of the SQL Server database engine.",
              "Training for end-users on the use of the new system version."
            ]
          },
          "technologies": [17, 10, 11, 12, 13, 14, 48, 63],
          "project_role_timeline": [
            {
              "role": 1,
              "start_date": "2023-06-01",
              "end_date": "2023-10-01"
            }
          ],
          "orden": 20230601,
          "project_id": 3
        },
        {
          "project_name": "Responsive Redesign of Information Page",
          "implementation_type": "On-premise",
          "company": "Veterinaria los Heroes El Salvador",
          "company_logo_path": "veterinarialosheroeselsalvador.png",
          "project_description": {
            "description": "Complete redesign of the Infopage application to improve the user experience with a fully responsive design.",
            "bullet_points": [
              "Complete redesign of the Infopage interface using React.",
              "Implementation of responsive design with CSS.",
              "Development of XSLT transformations for data processing.",
              "Development of backend scripts in .NET.",
              "Implementation on the client's IIS servers."
            ]
          },
          "technologies": [1, 3, 8, 5, 10, 12, 13, 14, 48, 63],
          "project_role_timeline": [
            {
              "role": 2,
              "start_date": "2023-08-01",
              "end_date": "2023-09-01"
            }
          ],
          "orden": 20230801,
          "project_id": 4
        },
        {
          "project_name": "Self-service Kiosk with BAC Camera",
          "implementation_type": "On-premise",
          "company": "BAC Guatemala",
          "company_logo_path": "bacguatemala.png",
          "project_description": {
            "description": "Development of a self-service kiosk with Windows camera integration for photo capture in specific flows. The solution included a Windows Forms application for hardware integration and a modern web interface for user interaction.",
            "bullet_points": [
              "Development of a Windows Forms application for camera integration.",
              "Development of a kiosk interface with React.",
              "Development of scripts in .NET for file handling.",
              "Creation of objects in SQL Server for data storage.",
              "Remote implementation on the client's servers."
            ]
          },
          "technologies": [1, 5, 27, 11, 18, 48, 63],
          "project_role_timeline": [
            {
              "role": 2,
              "start_date": "2023-08-01",
              "end_date": "2023-10-01"
            }
          ],
          "orden": 20230801,
          "project_id": 5
        },
        {
          "project_name": "Sense Platform Update",
          "implementation_type": "On-premise",
          "company": "Claro El Salvador",
          "company_logo_path": "claroelsalvador.png",
          "project_description": {
            "description": "Update of the Sense system and its integration with Q-flow. The project included requirements gathering, coordination with the development team, and implementation of improvements to the existing system.",
            "bullet_points": [
              "Analysis and gathering of system improvement requirements.",
              "Coordination with the development team for the implementation of improvements.",
              "Installation of a new version of the application on Windows Server.",
              "Execution of update scripts on SQL Server.",
              "Remote implementation of system improvements.",
              "Verification and testing of the updated system.",
              "Certify integrations with QFlow."
            ]
          },
          "technologies": [5, 17, 11, 18, 48, 63],
          "project_role_timeline": [
            {
              "role": 1,
              "start_date": "2023-08-01",
              "end_date": "2023-10-31"
            }
          ],
          "orden": 20230801,
          "project_id": 6
        },
        {
          "project_name": "Self-service Kiosk Application Update",
          "implementation_type": "On-premise",
          "company": "Promerica El Salvador",
          "company_logo_path": "promericaelsalvador.svg",
          "project_description": {
            "description": "Update of the self-service kiosk's visual interface, including changes to typography and visual elements. The application is used in all bank branches nationwide.",
            "bullet_points": [
              "Implementation of new typography in the kiosk interface.",
              "Update of visual elements to improve the user experience.",
              "Deployment of changes to the client's IIS servers.",
              "Implementation in all bank branches nationwide."
            ]
          },
          "technologies": [7, 16, 8, 10, 12, 13, 14, 48, 63],
          "project_role_timeline": [
            {
              "role": 1,
              "start_date": "2023-09-01",
              "end_date": "2023-10-01"
            }
          ],
          "orden": 20230901,
          "project_id": 7
        },
        {
          "project_name": "Implementation of Qflow Platform and Components",
          "implementation_type": "On-premise",
          "company": "Microlab Honduras",
          "company_logo_path": "microlabhonduras.png",
          "project_description": {
            "description": "Implementation of the Q-flow queue management system and Sense audio monitoring system for the Microlab clinical laboratory in Honduras. The project included the development of a self-service kiosk, an information screen (infopage), and integration between both platforms.",
            "bullet_points": [
              "Development of a self-service kiosk with Angular.",
              "Development of an 'Infopage' module with React and WebSockets.",
              "Requirements analysis and design of customer service flows.",
              "Configuration of Windows server and SQL Server database.",
              "Development of scripts in .NET for integration with the Sense audio monitoring system.",
              "On-site hardware and software installation in Tegucigalpa.",
              "Training for staff and managers on the use of the new tools."
            ]
          },
          "technologies": [15, 1, 4, 5, 17, 11, 12, 13, 14, 48, 63],
          "project_role_timeline": [
            {
              "role": 2,
              "start_date": "2023-10-01",
              "end_date": "2024-03-01"
            },
            {
              "role": 1,
              "start_date": "2024-03-01",
              "end_date": "2024-03-31"
            }
          ],
          "orden": 20231001,
          "project_id": 8
        },
        {
          "project_name": "Self-service Kiosk Maintenance",
          "implementation_type": "On-premise",
          "company": "Aguas de Saltillo Mexico",
          "company_logo_path": "aguasdesaltillomexico.png",
          "project_description": {
            "description": "Troubleshooting operational issues in the self-service kiosk inherited from a previous developer. The project included updating the client's operating system and improving the application's functional design.",
            "bullet_points": [
              "Diagnosis and resolution of issues in specific kiosk flows.",
              "Operating system upgrade from Windows 7 to Windows 10.",
              "Installation of missing libraries on the system.",
              "Improvements to the application's functional design."
            ]
          },
          "technologies": [7, 16, 8, 17, 12, 13, 14, 48, 63],
          "project_role_timeline": [
            {
              "role": 2,
              "start_date": "2023-11-01",
              "end_date": "2024-01-01"
            }
          ],
          "orden": 20231101,
          "project_id": 9
        },
        {
          "project_name": "National Implementation of Qflow and CNR Integrations",
          "implementation_type": "On-premise",
          "company": "National Registry Center El Salvador",
          "company_logo_path": "cnrelsalvador.png",
          "project_description": {
            "description": "Implementation of the Q-flow queue management system for the National Registry Center (CNR) of El Salvador. Self-service kiosks, information screens (infopages) were implemented, and service flows were designed to optimize customer service processes in the 14 branches nationwide.",
            "bullet_points": [
              "Development of a self-service kiosk for queues and appointments.",
              "Development of the 'Infopage' module.",
              "Design and adaptation of service flows.",
              "Installation and configuration of the system in 14 branches nationwide.",
              "Training for staff of the 14 branches nationwide."
            ]
          },
          "technologies": [1, 2, 3, 4, 5, 6, 7, 8, 10, 11, 12, 13, 14, 48, 63],
          "project_role_timeline": [
            {
              "role": 2,
              "start_date": "2024-01-01",
              "end_date": "2024-07-01"
            },
            {
              "role": 1,
              "start_date": "2024-06-01",
              "end_date": "2024-11-30"
            }
          ],
          "orden": 20240101,
          "project_id": 10
        },
        {
          "project_name": "Redesign of Self-service Kiosk Service Flow",
          "implementation_type": "On-premise",
          "company": "Banpais Honduras",
          "company_logo_path": "banpaisonduras.png",
          "project_description": {
            "description": "Redesign of the self-service kiosk interface and queuing flows to optimize customer service. The implementation was performed remotely on the client's servers.",
            "bullet_points": [
              "Redesign of the kiosk interface with React.",
              "Development of a new service flow with a change in queuing prioritization.",
              "Creation of a .NET script for the new flow's logic.",
              "Remote implementation on the client's servers using Remote Desktop and IIS."
            ]
          },
          "technologies": [1, 5, 10, 18, 12, 13, 14, 48, 63],
          "project_role_timeline": [
            {
              "role": 2,
              "start_date": "2024-02-01",
              "end_date": "2024-04-01"
            }
          ],
          "orden": 20240201,
          "project_id": 11
        },
        {
          "project_name": "Customer Identification Integration",
          "implementation_type": "On-premise",
          "company": "Davivienda Honduras",
          "company_logo_path": "daviviendahonduras.png",
          "project_description": {
            "description": "Development and integration of a new feature to identify customers by document or passport at the self-service kiosk, including the design of an alphanumeric keyboard interface and integration with the client's REST services.",
            "bullet_points": [
              "Design and implementation of an alphanumeric keyboard interface for document entry.",
              "Integration with REST services provided by the client.",
              "Backend development with Java and Spring Boot.",
              "Remote implementation on the client's JBoss server.",
              "Update of the self-service kiosk application."
            ]
          },
          "technologies": [1, 2, 21, 22, 23, 24, 25, 12, 13, 14, 48, 63],
          "project_role_timeline": [
            {
              "role": 2,
              "start_date": "2024-03-01",
              "end_date": "2024-05-01"
            }
          ],
          "orden": 20240301,
          "project_id": 12
        },
        {
          "project_name": "Development of Self-service Kiosk with Multiple Integrations",
          "implementation_type": "On-premise",
          "company": "Santander México",
          "company_logo_path": "santandermexico.png",
          "highlight": true,
          "project_description": {
            "description": "Development of a highly optimized self-service kiosk for over 1000 branches in production, with parameterization according to the branch type (Café, Business, Personal Banking). The project included integration with card reading hardware and identity validation.",
            "bullet_points": [
              "Development of a parameterizable interface according to branch type with React and Tailwind.",
              "Implementation of REST and SOAP integrations with banking services.",
              "Development of a Windows Forms application for card reader integration.",
              "Performance optimization for mass deployment.",
              "Backend development with .NET for integration scripts.",
              "Implementation of identity validation and banking security."
            ]
          },
          "technologies": [1, 26, 8, 4, 29, 5, 10, 24, 33, 12, 13, 14, 48, 63],
          "project_role_timeline": [
            {
              "role": 2,
              "start_date": "2024-03-01",
              "end_date": "2024-09-01"
            }
          ],
          "orden": 20240301,
          "project_id": 13
        },
        {
          "project_name": "RNPN Self-service Kiosk and Infopage",
          "implementation_type": "On-premise",
          "company": "National Registry of Natural Persons El Salvador",
          "company_logo_path": "rnpnelsalvador.png",
          "project_description": {
            "description": "Development from scratch of the self-service kiosk and Infopage for the National Registry of Natural Persons (RNPN). The development was carried out according to the specifications and business rules provided through Jira tickets.",
            "bullet_points": [
              "Development of a self-service kiosk with React and Tailwind.",
              "Development of an Infopage with React and Tailwind.",
              "Development of integration scripts with Q-flow in .NET.",
              "Implementation of business rules according to Jira specifications.",
              "Preparation of the installation package for the implementation team."
            ]
          },
          "technologies": [1, 26, 5, 12, 13, 14, 48, 63],
          "project_role_timeline": [
            {
              "role": 2,
              "start_date": "2024-04-01",
              "end_date": "2024-05-01"
            }
          ],
          "orden": 20240401,
          "project_id": 14
        },
        {
          "project_name": "Kiosk/Infopage Development Mentorship",
          "implementation_type": "Internal Training / Technical Mentorship",
          "company": "ACF Technologies LATAM",
          "highlight": false,
          "company_logo_path": "acftechnologieslatam.png",
          "project_description": {
            "description": "Mentorship and training for new developers on the team, focused on the development, structure, and integration of self-service kiosks and infopages, as well as best practices for integration with Q-flow and extending functionalities.",
            "bullet_points": [
              "Preparation of educational material and technical documentation on the architecture and development of self-service kiosks and infopages.",
              "Practical and theoretical sessions on project structure, integration with Q-flow, and service flows.",
              "Explanation of the extensibility and customization of modules according to client requirements.",
              "Personalized mentorship to resolve technical questions and accelerate the onboarding of new team members.",
              "Transfer of best practices for development, deployment, and maintenance of the systems."
            ]
          },
          "technologies": [5, 1, 11, 4, 24, 48, 63],
          "project_role_timeline": [
            {
              "role": 2,
              "start_date": "2024-04-01",
              "end_date": "2024-08-31"
            }
          ],
          "orden": 20240401,
          "project_id": 26
        },
        {
          "project_name": "Online Appointment Booking System (OABS)",
          "implementation_type": "Client Cloud hosted",
          "company": "SURA México",
          "highlight": true,
          "company_logo_path": "suramexico.png",
          "project_description": {
            "description": "Development of an online appointment booking system (OABS) for SURA México. The project included integration with third-party services for CURP validation and OCR technology, as well as the implementation of complex queuing and prioritization flows.",
            "bullet_points": [
              "Analysis of client requirements.",
              "Application development with Angular and .NET.",
              "Integration with third-party services for CURP and OCR validation.",
              "Design and implementation of queuing and prioritization flows based on input data."
            ]
          },
          "technologies": [15, 5, 9, 19, 12, 13, 14, 48, 63],
          "project_role_timeline": [
            {
              "role": 2,
              "start_date": "2024-05-01",
              "end_date": "2024-08-01"
            }
          ],
          "orden": 20240501,
          "project_id": 15
        },
        {
          "project_name": "Q-flow Implementation in New Branches",
          "implementation_type": "On-premise",
          "company": "Banco Cuscatlán El Salvador",
          "company_logo_path": "bancocuscatlanelsalvador.png",
          "project_description": {
            "description": "Implementation of the Q-flow system in new bank branches. The project included system configuration, integration review, functional testing of queuing, and certification of functionality in each branch.",
            "bullet_points": [
              "Configuration of new branches in the Q-flow platform.",
              "Review and validation of integration scripts.",
              "Functional testing of queuing on self-service kiosks.",
              "Verification of display on information screens (Infopage).",
              "Service testing in Q-flow.",
              "Certification of the system's overall functionality."
            ]
          },
          "technologies": [17, 11, 20, 10, 5, 12, 13, 14, 48, 63],
          "project_role_timeline": [
            {
              "role": 1,
              "start_date": "2024-06-01",
              "end_date": "2024-09-01"
            }
          ],
          "orden": 20240601,
          "project_id": 16
        },
        {
          "project_name": "Self-service Kiosk on Azure",
          "implementation_type": "ACF Cloud hosted",
          "company": "BBVA México",
          "highlight": true,
          "company_logo_path": "bbvamexico.png",
          "project_description": {
            "description": "Development of a self-service kiosk application for BBVA México with advanced integrations including WhatsApp, card reading, and identity validation. The project included cloud infrastructure setup and deployment with Cloudflare.",
            "bullet_points": [
              "Development of a self-service kiosk application with React, Axios, and Bootstrap.",
              "Implementation of WhatsApp integration for notifications.",
              "Development of integration with Windows Forms for card reading.",
              "Implementation of JWT authentication for cloud security.",
              "Configuration of Cloudflare for frontend protection and optimization.",
              "Implementation of captcha for user validation.",
              "Development of REST integrations for communication with external services.",
              "Configuration of Windows Server servers in ACF's cloud.",
              "Configuration of database instances in the cloud infrastructure.",
              "Backend development with .NET for integration scripts."
            ]
          },
          "technologies": [1, 29, 2, 4, 30, 31, 32, 10, 24, 12, 13, 14, 48, 63],
          "project_role_timeline": [
            {
              "role": 2,
              "start_date": "2024-07-01",
              "end_date": "2025-01-01"
            }
          ],
          "orden": 20240701,
          "project_id": 17
        },
        {
          "project_name": "New Self-service Kiosk Development",
          "implementation_type": "Client Cloud hosted",
          "company": "BAC Regional (GT, SV, HN, CR, PA)",
          "company_logo_path": "bacguatemala.png",
          "project_description": {
            "description": "Development of a new self-service kiosk application for all BAC branches in Central America. The project included redesigning flows for external ticket validation, user identification via REST integration with AS-400, and deployment on the client's cloud infrastructure.",
            "bullet_points": [
              "Regional requirements gathering.",
              "Redesign of service and ticket validation flows.",
              "Development of REST integration with AS-400 for user identification.",
              "Backend development with .NET and creation of objects in SQL Server.",
              "Implementation on the client's Azure servers."
            ]
          },
          "technologies": [5, 11, 9, 24, 28, 14, 48, 63],
          "project_role_timeline": [
            {
              "role": 2,
              "start_date": "2024-08-01",
              "end_date": "2025-01-01"
            }
          ],
          "orden": 20240801,
          "project_id": 18
        },
        {
          "project_name": "Information Page Application Redesign",
          "implementation_type": "On-premise",
          "company": "Banco Agrícola El Salvador",
          "company_logo_path": "bancoagricolaelsalvador.png",
          "project_description": {
            "description": "Complete redesign of the Infopage application for all bank branches, implementing a responsive design adaptable to any TV size and a custom multimedia content management system by location and schedule.",
            "bullet_points": [
              "Gathering specific requirements for customizing advertising campaigns.",
              "Development of a multimedia configuration system by location.",
              "Implementation of time-based scheduling for multimedia content.",
              "Design and implementation of a responsive interface with React and Bootstrap.",
              "Development of business logic with RxJS for state and event management.",
              "Remote deployment to client servers for all branches."
            ]
          },
          "technologies": [1, 2, 6, 8, 10, 12, 13, 14, 48, 63],
          "project_role_timeline": [
            {
              "role": 2,
              "start_date": "2024-10-01",
              "end_date": "2025-01-01"
            }
          ],
          "orden": 20241001,
          "project_id": 19
        },
        {
          "project_name": "Self-service Kiosk Application Development",
          "implementation_type": "ACF Cloud hosted",
          "company": "Siman El Salvador",
          "company_logo_path": "siman.png",
          "project_description": {
            "description": "Development of a new self-service kiosk application for Siman El Salvador, implementing a responsive design adaptable to any monitor size with integrations for package delivery validation.",
            "bullet_points": [
              "Development of a self-service kiosk application with React, Axios, and Bootstrap.",
              "Development of integrations with internal Salesforce and delivery tracking systems.",
              "Design and implementation of a responsive interface with React and Bootstrap."
            ]
          },
          "technologies": [1, 2, 6, 8, 10, 12, 13, 14, 48, 63],
          "project_role_timeline": [
            {
              "role": 2,
              "start_date": "2024-11-01",
              "end_date": "2024-12-01"
            }
          ],
          "orden": 20241001,
          "project_id": 20
        },
        {
          "project_name": "Design of Self-service Kiosk and Infopage",
          "implementation_type": "ACF Cloud hosted",
          "company": "Government of Zapopan Mexico",
          "company_logo_path": "zapopan.png",
          "project_description": {
            "description": "Development of a new self-service kiosk application for the Government of Zapopan, Mexico, implementing a responsive design adaptable to any monitor size with package delivery validation integrations.",
            "bullet_points": [
              "Development of a self-service kiosk application with React, Axios, and Bootstrap.",
              "Design and implementation of a responsive interface with React and Bootstrap.",
              "Design of an information page application with responsive templates."
            ]
          },
          "technologies": [1, 2, 6, 8, 10, 12, 13, 14, 48, 63],
          "project_role_timeline": [
            {
              "role": 2,
              "start_date": "2024-10-01",
              "end_date": "2024-11-01"
            }
          ],
          "orden": 20241002,
          "project_id": 21
        }
      ]
    },
    {
      "type": "company",
      "company": "Grupo LS EL Salvador",
      "description": "Grupo LS El Salvador offers innovative financial solutions, including vehicle leasing, vehicle purchase and sale, and flexible financing services. It facilitates access to vehicles through lease-to-own, immediate loans with vehicle collateral, and accessible financing options, adapting to the needs of both individual and business clients in El Salvador.",
      "logo_url": "glssv.png",
      "resume": "Responsible for the development and maintenance of technological solutions, with a focus on process improvement. I completed key digital transformation projects for the company, including the integration of GPS systems for the vehicle fleet and the development of custom solutions for asset management and financial services, as well as expanding the processes covered by the company's main system. Provide IT support to all company personnel.",
      "orden": 5,
      "job_roles": [
        {
          "job_role": "Developer Analyst",
          "job_role_id": 5,
          "start_date": "2021-04-21",
          "end_date": "2023-03-16",
          "actually": false,
          "responsabilities": [
            {"description": "Gathering and analyzing requirements with business owners for new developments and improvements."},
            {"description": "Designing and developing modules and functionalities in PowerBuilder and Windows Forms."},
            {"description": "Maintenance, continuous improvement, and support of the main business and customer management system."},
            {"description": "Creating and optimizing database objects: triggers, stored procedures, and functions in SQL Server."},
            {"description": "Developing integrations between internal and external systems (e.g., GPS data integration with MySQL and SQL Server)."},
            {"description": "Developing and deploying static websites in PHP, HTML, CSS, and JS for company brands."},
            {"description": "Implementing and supporting technological infrastructure: structured cabling, networks, servers, security cameras, and telephony."},
            {"description": "Training end-users on the use of new developed modules and systems."},
            {"description": "Providing technical support to users for IT and system issues."}
          ]
        }
      ],
      "projects": [
        {
          "project_name": "Network Infrastructure Installation at New Headquarters",
          "implementation_type": "On-premise",
          "company": "Grupo LS El Salvador",
          "company_logo_path": "grupolselsalvador.png",
          "project_description": {
            "description": "Project for the installation, configuration, and commissioning of the technological and security infrastructure in the new Grupo LS El Salvador building, ensuring connectivity, security, and operation of all areas during the move and adaptation of the facilities. It included the assembly and configuration of rack servers and the installation of structured network cabling for internet and telephony.",
            "bullet_points": [
              "Installation of structured cabling for data network, telephone lines, and security cameras throughout the building.",
              "Configuration and commissioning of Cisco switches, routers, and repeaters.",
              "Physical installation and configuration of video surveillance cameras (CCTV/IP), including cabling and strategic placement.",
              "Crimping and assembly of RJ45 cables (straight-through and crossover) according to network needs.",
              "Logical design and configuration of the network topology, including subnetting and network segmentation.",
              "Assembly and configuration of rack servers, ensuring their connectivity and operation.",
              "Management and configuration of connectivity with internet and telephony providers for the building's operation.",
              "Testing of connectivity, security, and functionality of the installed network and systems.",
              "On-site technical troubleshooting and support during the adaptation of the facilities."
            ]
          },
          "technologies": [56, 57, 58, 59, 60, 61],
          "project_role_timeline": [
            {
              "role": 5,
              "start_date": "21-04-2021",
              "end_date": "20-07-2021"
            }
          ],
          "orden": 20230101,
          "project_id": 25
        },
        {
          "project_name": "Development of New Features in the Business Management System",
          "implementation_type": "On-premise",
          "company": "Grupo LS El Salvador",
          "highlight": true,
          "company_logo_path": "grupolselsalvador.png",
          "project_description": {
            "description": "Maintenance, continuous improvement, and functional expansion project of the main system of Grupo LS El Salvador, covering from requirements gathering to the delivery of complete modules and reports for business and customer management. It included implementation, user training, and technical support for end-users.",
            "bullet_points": [
              "Gathering requirements and analyzing business processes with business owners.",
              "Designing data flows and architecture for new modules and functionalities.",
              "Creating and optimizing database objects: triggers, stored procedures, and functions.",
              "Developing the quotation module according to specific business rules.",
              "Implementing customer data capture and registration, and virtual file generation and management.",
              "Automating the identification of pre-business data and classification by business type.",
              "Developing a workflow for transferring files to the legal department for verification.",
              "Implementing a business approval system with a panel for management.",
              "Automatically generating documents for signature with collected data.",
              "Developing a reception module for preliminary data collection and equitable assignment of clients to salespeople.",
              "Implementing queue logic for service and load balancing among salespeople.",
              "Creating multiple stored procedures for generating custom reports.",
              "Continuously delivering improvements, renewals, and new functionalities according to business needs.",
              "Training staff on the correct use of newly developed modules.",
              "Providing technical support to users for any IT issues related to the system or work environment."
            ]
          },
          "technologies": [53, 27, 11, 17],
          "project_role_timeline": [
            {
              "role": 5,
              "start_date": "21-04-2021",
              "end_date": "16-03-2023"
            }
          ],
          "orden": 20230101,
          "project_id": 22
        },
        {
          "project_name": "Vehicle GPS Integration",
          "implementation_type": "On-premise",
          "company": "Grupo LS El Salvador",
          "highlight": false,
          "company_logo_path": "grupolselsalvador.png",
          "project_description": {
            "description": "Integration of data collected by GPS devices installed in the company's vehicles, allowing for internal visualization and analysis of location and route information.",
            "bullet_points": [
              "Development of .NET scripts executed by a cron job on the server for periodic data collection from an external MySQL database.",
              "Transformation and normalization of GPS data for integration with internal systems.",
              "Implementation of functions and procedures in SQL Server for processing and storing the transformed data.",
              "Development of a PowerBuilder module for visualizing and analyzing vehicle location information.",
              "Automation of the integration flow to ensure continuous updating of GPS data in the internal database."
            ]
          },
          "technologies": [5, 53, 11, 55],
          "project_role_timeline": [
            {
              "role": 5,
              "start_date": "01-09-2023",
              "end_date": "30-11-2023"
            }
          ],
          "orden": 20230901,
          "project_id": 24
        },
        {
          "project_name": "Prestauto Website",
          "implementation_type": "Web Hosting",
          "company": "Grupo LS El Salvador - Prestauto",
          "company_logo_path": "grupolselsalvador.png",
          "project_description": {
            "description": "Development and deployment of a static website for the Prestauto brand, aimed at promoting vehicle leasing and financing services with integration of communication channels and social media.",
            "bullet_points": [
              "Requirements gathering and content structure definition for the Prestauto brand.",
              "Design and layout of a responsive static website.",
              "Development in PHP for form handling and basic structure.",
              "Implementation of custom styles with CSS and interactive functionalities with JavaScript.",
              "Use of HTML for content structure and presentation.",
              "Deployment and configuration of the site on GoDaddy hosting via cPanel.",
              "Optimization for modern browsers and mobile devices."
            ]
          },
          "technologies": [54, 16, 8, 7],
          "project_role_timeline": [
            {
              "role": 5,
              "start_date": "01-01-2024",
              "end_date": "31-03-2024"
            }
          ],
          "orden": 20240101,
          "project_id": 23
        }
      ]
    },
    {
      "type": "work",
      "company": "Personal Projects",
      "description": "Block dedicated to the creation and development of personal projects and technological practices, demonstrating initiative, continuous learning, and professional updating to stand out to recruiters.",
      "logo_url": "logopersonal.png",
      "resume": "I have taken AI beyond APIs. My focus is on creating agentic systems with access to MCP and A2A tools (LangChain, Google & Vercel AI SDK) and optimizing LLMs with Retrieval-Augmented Generation (Qdrant, RAG, Embeddings) and Fine-tuning (Unsloth, Google Colab, Anyscale). Automating their lifecycle in the cloud with CI/CD, Github Actions, Docker, and Serverless. My goal is to build and deploy AI solutions that solve complex business challenges.",
      "orden": 2,
      "job_roles": [
        {
          "job_role": "AI Engineer",
          "job_role_id": 2002,
          "start_date": "2024-01-01",
          "show_first": true,
          "end_date": null,
          "actually": true,
          "responsabilities": [
            {"description": "Developing end-to-end AI applications, building functional prototypes with agentic systems and RAG to validate cutting-edge technologies in the cloud."},
            {"description": "Programming agentic solutions with access to MCP and A2A tools (LangChain, Google & Vercel AI SDK) and optimizing LLMs with RAG (Embeddings) and Fine-tuning (Unsloth, colab)."},
            {"description": "Specialist in the customization of language models (LLMs) through Fine-tuning techniques, adapting base models to dramatically improve their accuracy."},
            {"description": "Advanced management and orchestration of cloud infrastructures (MCPs), optimizing resources to ensure maximum scalability and cost efficiency."},
            {"description": "Driven by the vision of using AI as a catalyst for innovation, focused on solving large-scale problems and creating solutions that define the future."}
          ]
        },
        {
          "job_role": "Fullstack Developer",
          "job_role_id": 2001,
          "start_date": "2019-01-01",
          "end_date": null,
          "actually": true,
          "responsabilities": [
            {"description": "Mastery of full-stack development to create cohesive solutions, integrating intuitive user interfaces with robust backend services."},
            {"description": "Management of the complete software development lifecycle (SDLC), automating deployment to the cloud with CI/CD, Github Actions, and Docker or serverless."},
            {"description": "Implementation of robust software architectures applying principles of clean code and security, ensuring high-quality solutions and an intuitive UX."},
            {"description": "Application of a DevOps culture to accelerate the delivery of solutions, focusing on continuous integration, automation, and production monitoring."}
          ]
        }
      ],
      "projects": [
        {
          "project_name": "Personal Portfolio with AI Assistant",
          "implementation_type": "Cloud",
          "company": "Personal Project",
          "company_logo_path": "logopersonal.png",
          "highlight": true,
          "project_description": {
            "description": "Development of a modern, high-performance web portfolio focused on user experience. It integrates a conversational virtual assistant to offer dynamic interaction and provide information about my professional career, projects, and technical skills in an intuitive way.",
            "bullet_points": [
              "Development of a high-performance frontend with Astro and React for a fluid and modern interface.",
              "Implementation of a robust backend with Node.js and Express for server logic and API.",
              "Integration of Prisma as an ORM for safe and efficient interaction with the database.",
              "Use of Supabase and PostgreSQL for persistent and scalable data storage.",
              "Implementation of conversational AI functionalities with Vercel AI SDK and Google Genai.",
              "Securing public APIs with RateLimit, CORS, and Google Captcha strategies.",
              "Integration with the Brevo email service for contact functionality.",
              "Continuous serverless deployment to the cloud using Vercel.",
              "Advanced DNS and CNAME configuration for custom domain management.",
              "Complete automation of the development lifecycle (CI/CD) with GitHub Actions.",
              "Version control and code collaboration managed through Git and GitHub."
            ]
          },
          "technologies": [77, 1, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 32],
          "project_role_timeline": [
            {
              "role": 5,
              "start_date": "01-01-2024",
              "end_date": null
            }
          ],
          "orden": 20240101,
          "project_id": 25
        },
        {
          "project_name": "Agent Ecosystem and Personal Compute Server (MCP)",
          "implementation_type": "Cloud",
          "company": "Personal Project / R&D",
          "company_logo_path": "logopersonal.png",
          "highlight": true,
          "project_description": {
            "description": "Design and construction of a Personal Compute Server (MCP) for the orchestration of an advanced AI agent ecosystem. This project focuses on creating agentic tools (A2A) capable of interacting with external services, processing and enriching data for vector databases, and automating complex tasks, laying the groundwork for future integrations with intelligent assistants like Google Gemini.",
            "bullet_points": [
              "Development of a server with FastAPI to orchestrate AI workflows and expose agentic tools.",
              "Creation of agentic systems with LangChain and Google GenAI with access to custom tools (A2A).",
              "Experimentation with AI model consumption platforms like Anyscale and Replicate.",
              "Data engineering to process and format information for ingestion into vector databases like Qdrant and Weaviate.",
              "Development of generative AI tools for creating images and video.",
              "Creation of agent prototypes to interact with and update external applications (expense tracking, time management).",
              "Integration with external services like Brevo for notifications and automated communication.",
              "Containerization of AI services and tools using Docker for portability and scalability.",
              "Lifecycle management and automated deployment of AI tools with GitHub Actions."
            ]
          },
          "technologies": [95, 68, 83, 150, 148, 149, 146, 147, 87, 151, 88, 89, 67],
          "project_role_timeline": [
            {
              "role": 5,
              "start_date": "01-01-2024",
              "end_date": null
            }
          ],
          "orden": 20240102,
          "project_id": 26
        },
        {
          "project_name": "Personal Expense Tracking Application",
          "implementation_type": "On-premise",
          "company": "Personal Project",
          "company_logo_path": "logopersonal.png",
          "highlight": false,
          "project_description": {
            "description": "Development of a full-stack web application for personal finance management, using the MERN stack (MongoDB, Express, React, Node.js) with TypeScript. The application is designed for simple and frictionless transaction logging, and features interactive dashboards built with ECharts to visualize financial behavior and get clear monthly summaries.",
            "bullet_points": [
              "Implementation of a robust backend with Node.js and Express, using TypeScript for typed and scalable code.",
              "Design of a reactive and efficient user interface with React for logging income and expenses.",
              "Use of MongoDB as a NoSQL database to store transactions flexibly.",
              "Creation of dashboards and visual reports with charts (pie and bar) using the ECharts library.",
              "Functionality to view the total balance, filter transaction history, and generate monthly summaries.",
              "Base project with plans to be revisited to integrate future AI functionalities for predictive expense analysis."
            ]
          },
          "technologies": [1, 78, 79, 89, 152, 153, 154],
          "project_role_timeline": [
            {
              "role": 5,
              "start_date": "2019-01-01",
              "end_date": "2019-12-31"
            }
          ],
          "orden": 20190101,
          "project_id": 27
        },
        {
          "project_name": "Goal and Time Management Application",
          "implementation_type": "On-premise",
          "company": "Personal Project",
          "company_logo_path": "logopersonal.png",
          "highlight": false,
          "project_description": {
            "description": "Construction of a full-stack web application for personal goal and productivity management using the .NET ecosystem. The backend was developed with ASP.NET Core to create a robust RESTful API, while the frontend was implemented with Blazor, allowing for an interactive and modern user interface with C#. Entity Framework was used for data access against a SQL Server database.",
            "bullet_points": [
              "Development of a REST API using ASP.NET Core to manage business logic.",
              "Creation of a dynamic user interface (SPA) with the Blazor framework.",
              "Object-relational mapping (ORM) implemented with Entity Framework to interact with the database.",
              "Design of a SQL Server database to store goals, progress, and notes.",
              "Implementation of key functionalities such as goal creation, progress tracking, and reminders.",
              "Dedicated section for quick annotation of ideas and future projects."
            ]
          },
          "technologies": [5, 11, 24, 89, 116, 155, 156],
          "project_role_timeline": [
            {
              "role": 5,
              "start_date": "2020-01-01",
              "end_date": "2020-12-31"
            }
          ],
          "orden": 20200101,
          "project_id": 28
        },
        {
          "project_name": "Management System for Adventist Church",
          "implementation_type": "Cloud",
          "company": "Seventh-day Adventist Church (Volunteer)",
          "company_logo_path": "adventistlogo.png",
          "highlight": false,
          "project_description": {
            "description": "Development of a comprehensive solution for the administration and communication of the local congregation. The system consists of a mobile application (React Native) and a backend (Node.js) to automate sending messages to WhatsApp groups, distribute announcements, and manage fundraising campaigns. The architecture is fully containerized with Docker and uses Clerk for modern and secure user management and authentication.",
            "bullet_points": [
              "Development of a cross-platform mobile application with React Native.",
              "Implementation of a backend with Node.js and TypeScript, using Prisma as an ORM for interaction with the PostgreSQL database.",
              "Direct integration with the WhatsApp Business API for automating communications and announcements.",
              "Specific module for controlling and tracking donations in fundraising campaigns.",
              "Implementation of a robust and secure user authentication and management system with Clerk.",
              "The entire application infrastructure is containerized with Docker for consistent deployment and scalability."
            ]
          },
          "technologies": [78, 81, 85, 89, 151, 153, 157, 158, 159],
          "project_role_timeline": [
            {
              "role": 5,
              "start_date": "2023-01-01",
              "end_date": "2024-12-31"
            }
          ],
          "orden": 20230101,
          "project_id": 29
        }
      ]
    },
    {
      "type": "study",
      "company": "Technological University of El Salvador",
      "description": "Career in Systems and Computer Engineering",
      "logo_url": "utec.png",
      "orden": 8,
      "skills": [121, 122, 123, 124, 125, 127, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144],
      "job_roles": [
        {
          "job_role": "Student of Systems and Computer Engineering",
          "job_role_id": 1001,
          "start_date": "2018-01-01",
          "end_date": "2023-12-31",
          "actually": false,
          "responsabilities": [
            {"description": "For three years, I provided tutoring in algorithms, OOP, and computational logic to new students, which allowed me to enhance my technical and leadership skills with groups of over 50 students."},
            {"description": "Development of technical skills in programming, data structures, algorithms, and computer architecture."},
            {"description": "Learning database design and management, operating systems, and computer networks."},
            {"description": "Software development following agile methodologies and best software engineering practices."},
            {"description": "Teamwork, effective communication, and complex problem-solving."},
            {"description": "Project management, planning, and efficient time organization."},
            {"description": "Critical thinking and analytical skills for technical decision-making."},
            {"description": "Continuous learning and adaptation to new technologies and programming languages."},
            {"description": "Research and application of best practices in development, security, and user experience."}
          ]
        }
      ],
      "projects": [
        {
          "project_name": "UTEC Academic Projects",
          "implementation_type": "Academic",
          "company": "Technological University of El Salvador",
          "company_logo_path": "utec.png",
          "highlight": true,
          "project_description": {
            "description": "A set of projects developed during the Systems and Computer Engineering degree, covering various technologies and development methodologies to solve real-world problems and apply the knowledge acquired in different subjects.",
            "bullet_points": [
              "News blog programmed in PHP using HTML, JavaScript, and CSS3, implementing a content management system with features for publishing, editing, and deleting articles.",
              "Student grade management system for INFRAMEN of San Salvador, developed in C# with SQL Server and Entity Framework, allowing the registration, consultation, and updating of grades.",
              "Design and implementation of network and server architecture in the university's laboratories, configuring network equipment, servers, and workstations.",
              "Android application for restaurant order management, which displayed pending, in-queue, and completed orders in real-time, facilitating communication between kitchen and waiters.",
              "iOS application developed with Swift for personal expense management and control, with features for recording, categorizing, and visualizing expenses through charts.",
              "Tutoring for over three years to new students, teaching object-oriented programming and algorithms with PSeInt, developing educational material and practical exercises.",
              "Design and modeling of relational databases using UML and entity-relationship diagrams, implementing solutions in SQL Server and MySQL.",
              "Development of applications with graphical interfaces for Windows and Linux operating systems, applying principles of usability and user experience.",
              "Implementation of digital systems and basic electronic circuits for device control, including laboratory practices with real components.",
              "Configuration and administration of computer centers, including software installation, hardware maintenance, and user management.",
              "Statistical data analysis for decision-making, using specialized tools and applying probability concepts."
            ]
          },
          "technologies": [54, 7, 8, 115, 11, 116, 117, 118, 119, 120, 126, 128, 129, 130, 131, 132, 133, 134, 145],
          "project_role_timeline": [
            {
              "role": 1001,
              "start_date": "2018-01-01",
              "end_date": "2023-12-31"
            }
          ],
          "orden": 20180101,
          "project_id": 106
        }
      ]
    },
    {
      "type": "study",
      "company": "Specialization in Technological Innovation in Industry 4.0",
      "description": "Graduation project and specialization in Industry 4.0.",
      "logo_url": "utec.png",
      "resume": "Specialized in key technologies of the Fourth Industrial Revolution, with practical experience in artificial intelligence, big data, IoT, robotics, cloud computing, and cybersecurity. I have developed projects that integrate advanced data analysis, information visualization, and cloud solutions, applying leadership and teamwork principles to implement technological innovations in industrial environments.",
      "orden": 2,
      "skills": [121, 122, 123, 124, 125, 127, 135, 137, 139, 140, 142],
      "job_roles": [
        {
          "job_role": "Artificial Intelligence for Industry 4.0",
          "job_role_id": 1002,
          "start_date": "2024-03-01",
          "end_date": "2024-05-31",
          "actually": false,
          "responsabilities": []
        },
        {
          "job_role": "Leadership and Team Management",
          "job_role_id": 1003,
          "start_date": "2024-03-01",
          "end_date": "2024-05-31",
          "actually": false,
          "responsabilities": []
        },
        {
          "job_role": "Big Data and Data Science",
          "job_role_id": 1004,
          "start_date": "2024-06-01",
          "end_date": "2024-08-31",
          "actually": false,
          "responsabilities": []
        },
        {
          "job_role": "Development of High-Performance Teams",
          "job_role_id": 1005,
          "start_date": "2024-06-01",
          "end_date": "2024-08-31",
          "actually": false,
          "responsabilities": []
        },
        {
          "job_role": "Data Visualization and Analysis",
          "job_role_id": 1006,
          "start_date": "2024-09-01",
          "end_date": "2024-10-31",
          "actually": false,
          "responsabilities": []
        },
        {
          "job_role": "IoT and Industrial Robotics",
          "job_role_id": 1007,
          "start_date": "2024-11-01",
          "end_date": "2024-12-31",
          "actually": false,
          "responsabilities": []
        },
        {
          "job_role": "Cloud Computing",
          "job_role_id": 1008,
          "start_date": "2024-09-01",
          "end_date": "2024-12-31",
          "actually": false,
          "responsabilities": []
        },
        {
          "job_role": "Industrial Cybersecurity",
          "job_role_id": 1009,
          "start_date": "2024-10-01",
          "end_date": "2024-12-31",
          "actually": false,
          "responsabilities": []
        }
      ],
      "projects": [
        {
          "project_name": "Neural Networks and Computer Vision",
          "implementation_type": "Academic project / Applied research",
          "company": "Technological University of El Salvador",
          "company_logo_path": "utec.png",
          "highlight": true,
          "project_description": {
            "description": "Development and training of a small, multilayer neural network using Keras and PyTorch, with an academic and experimental approach. The project included solving a simple mathematical problem using a four-layer network (two-neuron input, two hidden layers of two neurons, and three-neuron output), as well as experimenting with computer vision models for object identification in images and inference in video and real-time camera. Tools such as Pandas for data handling, Matplotlib for visualization, OpenCV for image processing, and Google Colab as a cloud development environment were used.",
            "bullet_points": [
              "Design and training of a multilayer neural network to solve a specific mathematical equation.",
              "Implementation of object classification models in images using Keras and PyTorch.",
              "Deployment of models for real-time inference on video and local camera.",
              "Use of Pandas for manipulation and analysis of input and output data.",
              "Visualization of results and training metrics with Matplotlib.",
              "Image and video processing with OpenCV.",
              "Collaborative work and execution of experiments in Google Colab.",
              "Practical understanding of the functioning of multilayer networks and their application to real problems.",
              "Achievement of real-time inference and validation of results in different scenarios."
            ]
          },
          "technologies": [65, 66, 67, 68, 69, 70, 71],
          "project_role_timeline": [
            {
              "role": 1002,
              "start_date": "2024-03-01",
              "end_date": "2024-04-15"
            }
          ],
          "orden": 20240301,
          "project_id": 100
        },
        {
          "project_name": "Analysis/Decision Dashboards",
          "implementation_type": "Academic project / Data visualization",
          "company": "Technological University of El Salvador",
          "company_logo_path": "utec.png",
          "highlight": true,
          "project_description": {
            "description": "Development of interactive dashboards using Power BI and Looker Studio (Google) for the analysis of datasets provided by the university. The main objective was to extract relevant and visual information to support decision-making, applying data integration, cleaning, and transformation techniques with Python and specialized libraries. The project allowed for a comparison of the capabilities of both tools and an understanding of the impact of visualization on the data analysis process.",
            "bullet_points": [
              "Data integration, cleaning, and transformation using Python and libraries like pandas and numpy.",
              "Development of interactive dashboards and custom reports in Power BI and Looker Studio.",
              "Implementation of key visualizations: trend charts, segmentations, KPIs, and maps.",
              "Technical and functional comparison between Power BI and Looker Studio for different analysis scenarios.",
              "Presentation of insights and recommendations for data-driven decision-making.",
              "Automation of updates and connection to external data sources.",
              "Achievement of a deep understanding of the data analysis process and its impact on decision-making."
            ]
          },
          "technologies": [68, 67, 72, 73],
          "project_role_timeline": [
            {
              "role": 1004,
              "start_date": "2024-04-16",
              "end_date": "2024-05-31"
            }
          ],
          "orden": 20240416,
          "project_id": 101
        },
        {
          "project_name": "IoT Simulation with Node-RED/Python",
          "implementation_type": "Academic project / IoT and automation",
          "company": "Technological University of El Salvador",
          "company_logo_path": "utec.png",
          "highlight": true,
          "project_description": {
            "description": "Development of Python scripts to simulate IoT sensors, configuration of Node-RED to process and visualize messages, storage of simulated data in SQL Server, and educational exploration of programming a PLC robotic arm. The MQTT protocol was used for message communication, and different low-power IoT protocols and networks were analyzed to understand their applicability according to the environment and energy consumption requirements.",
            "bullet_points": [
              "Simulation of IoT sensors (temperature, humidity, motion, etc.) using Python scripts.",
              "Processing, visualization, and creation of data flows in Node-RED.",
              "Storage and querying of simulated data in SQL Server.",
              "Implementation and understanding of the MQTT protocol and other IoT communication protocols.",
              "Exploration and basic programming of movements in a PLC robotic arm using specialized software.",
              "Analysis of IoT architectures and low-power energy networks.",
              "Basic integration between simulation software, automation platforms, and educational hardware.",
              "Achievement of a comprehensive understanding of the components and flows of a real IoT system."
            ]
          },
          "technologies": [68, 74, 75, 11, 76],
          "project_role_timeline": [
            {
              "role": 1007,
              "start_date": "2024-06-01",
              "end_date": "2024-07-15"
            }
          ],
          "orden": 20240601,
          "project_id": 102
        },
        {
          "project_name": "Secure Cloud Infrastructure with Azure",
          "implementation_type": "Academic project / Cloud Administration and Cybersecurity",
          "company": "Technological University of El Salvador",
          "company_logo_path": "utec.png",
          "highlight": true,
          "project_description": {
            "description": "Design and deployment of a secure and scalable cloud infrastructure on Microsoft Azure, using student credits for resource provisioning. The project consisted of configuring Windows and Linux servers, implementing load balancers to distribute traffic, and creating virtual networks (VNets) to isolate resources. Authentication techniques were applied, and network security groups were configured to protect the infrastructure, culminating in the deployment of a test application to validate the architecture and its functionality.",
            "bullet_points": [
              "Provisioning of cloud resources on Azure, including virtual machines, networks, and load balancers.",
              "Configuration of two virtual servers: one with Windows Server and one with Linux.",
              "Implementation of a load balancer to ensure high availability and traffic distribution.",
              "Creation of a private virtual network (VNet) with subnets to segment and protect the infrastructure.",
              "Application of firewall rules using Network Security Groups (NSGs) to control inbound and outbound traffic.",
              "Configuration of authentication methods for secure access to servers.",
              "Deployment of a basic web application to simulate a production environment and validate the configuration.",
              "Achievement of a practical understanding of IaaS (Infrastructure as a Service) architecture on Azure and its security components."
            ]
          },
          "technologies": [9, 51, 17, 13, 18, 90, 91, 92, 93, 94],
          "project_role_timeline": [
            {
              "role": 1008,
              "start_date": "2024-10-15",
              "end_date": "2024-11-30"
            },
            {
              "role": 1009,
              "start_date": "2024-10-15",
              "end_date": "2024-11-30"
            }
          ],
          "orden": 20241015,
          "project_id": 103
        },
        {
          "project_name": "Serverless File Management Application on Azure",
          "implementation_type": "Academic project / Cloud Development (PaaS and Serverless)",
          "company": "Technological University of El Salvador",
          "company_logo_path": "utec.png",
          "highlight": true,
          "project_description": {
            "description": "Development of a web application using Python and FastAPI for file management in the Azure cloud. The solution integrates secure authentication with Microsoft Entra ID (Azure AD), allowing users to log in and upload files that are stored securely and scalably in Azure Blob Storage. The architecture combines PaaS services, with the main application deployed on Azure App Service, and Serverless components through Azure Functions to process background tasks. The deployment was fully automated through a CI/CD pipeline with Azure Pipelines, connected to a GitHub repository.",
            "bullet_points": [
              "Construction of a RESTful API with Python and the FastAPI framework for business logic.",
              "Implementation of a secure authentication flow based on OAuth 2.0 with Microsoft Entra ID.",
              "Native integration with Azure Blob Storage for user file upload, download, and management.",
              "Use of Azure App Service for continuous and scalable hosting of the main application.",
              "Development of microservices or asynchronous tasks with Azure Functions in a Serverless model.",
              "Configuration of a continuous integration and deployment (CI/CD) pipeline with Azure Pipelines from GitHub.",
              "Automation of builds, tests, and deployments on Azure services.",
              "Achievement of a functional and decoupled solution that leverages the advantages of PaaS and Serverless models in the cloud."
            ]
          },
          "technologies": [68, 9, 94, 89, 95, 96, 97, 98, 99],
          "project_role_timeline": [
            {
              "role": 1008,
              "start_date": "2024-12-01",
              "end_date": "2024-12-31"
            }
          ],
          "orden": 20241201,
          "project_id": 104
        },
        {
          "project_name": "Intelligent Parking Management System (Graduation Project)",
          "implementation_type": "Graduation Project / Comprehensive IoT Edge Solution",
          "company": "Technological University of El Salvador",
          "company_logo_path": "utec.png",
          "highlight": true,
          "project_description": {
            "description": "Thesis project for the degree of Specialist in Technological Innovation in Industry 4.0. A complete solution was developed for the electronic control and management of the university's parking lots. The pilot project consisted of installing ultrasonic sensors in 5 parking spaces, connected to a processing unit (Arduino and Raspberry Pi with an ESP32) to capture and transmit real-time data. The occupancy information was sent to an MQTT broker in Azure IoT Hub, processed, and queued in Azure Service Bus to be finally stored in a SQL Server database. The system culminated with an interactive dashboard in Power BI for real-time visualization, intelligent management, and historical data collection, laying the groundwork for future AI implementations for predictive analysis.",
            "bullet_points": [
              "Feasibility study and design of a pilot solution for parking automation.",
              "Installation and configuration of IoT hardware: ultrasonic sensors, Arduino, Raspberry Pi, and ESP32 connectivity modules.",
              "Development of firmware in C and Python for capturing sensor data and transmitting it securely via WiFi.",
              "Implementation of a cloud architecture on Azure for large-scale data ingestion using the MQTT protocol with Azure IoT Hub.",
              "Processing and queuing of messages to ensure reliable and orderly data delivery to the database.",
              "Persistent storage of occupancy data in SQL Server for querying historical and real-time information.",
              "Design and development of an interactive dashboard for live monitoring of parking status and decision-making.",
              "Creation of a historical data repository to enable future trend analysis and the application of Machine Learning models.",
              "Successful defense of the project before an evaluation committee, obtaining thesis approval and academic degree."
            ]
          },
          "technologies": [68, 75, 9, 11, 72, 100, 101, 102, 103, 104, 105, 106],
          "project_role_timeline": [
            {
              "role": 1004,
              "start_date": "2024-03-01",
              "end_date": "2024-12-31"
            },
            {
              "role": 1006,
              "start_date": "2024-03-01",
              "end_date": "2024-12-31"
            },
            {
              "role": 1007,
              "start_date": "2024-03-01",
              "end_date": "2024-12-31"
            },
            {
              "role": 1008,
              "start_date": "2024-03-01",
              "end_date": "2024-12-31"
            }
          ],
          "orden": 20240301,
          "project_id": 105
        }
      ]
    },
    {
      "type": "achievement",
      "company": "Graduation from Systems and Computer Engineering",
      "description": "",
      "logo_url": "utec.png",
      "orden": 4,
      "job_roles": [
        {
          "job_role": "Degree in Systems and Computer Engineering",
          "job_role_id": 1003,
          "start_date": "2025-05-30",
          "end_date": "2025-05-30",
          "actually": false,
          "responsabilities": []
        }
      ],
      "projects": []
    },
    {
      "type": "achievement",
      "company": "Adventist Youth Ministries, Inter-American Division",
      "description": "Leadership Curriculum for Ambassadors and Young Adult Leaders",
      "logo_url": "liderjuvenil.png",
      "orden": 7,
      "skills": [107, 108, 109, 110, 111, 112, 113],
      "job_roles": [
        {
          "job_role": "Certified Youth Leader (Mentor)",
          "job_role_id": 1015,
          "start_date": "2021-01-01",
          "end_date": "2021-12-31",
          "responsabilities": [
            {"description": "Understanding the history, philosophy, vision, objectives, and structure of the Adventist Youth Ministry."},
            {"description": "Developing skills to understand and adapt to today's youth, including the digital environment."},
            {"description": "Spiritual leadership, counseling, and friendship with young people, acting as an example of Christ."},
            {"description": "Promoting youth belonging and empowerment in the church, delegating responsibilities."},
            {"description": "Purpose-driven church planning, using the four dynamic biblical forces (Grace, Worship, Community, Service)."},
            {"description": "Developing creative, balanced youth programs aligned with the annual themes of the Youth Ministries."},
            {"description": "Discovering, motivating, and utilizing the spiritual gifts of young people for service and the edification of the church."},
            {"description": "Maximizing opportunities and avoiding the threats of social media in digital ministry."}
          ]
        }
      ],
      "projects": []
    }
  ]
}